package com.yunqi.clientandroid.employer.util;

/**
 * 所有省市区的数组
 * Created by mengwei on 2017/5/16.
 */

public class AddressUtils {
    /**
     * 所有省份名称
     */
    public static String[] provinceName = new String[]{
            "山西", "内蒙古", "陕西", "天津", "山东", "河北", "河南", "新疆", "湖北", "湖南", "江苏",
            "宁夏", "四川", "安徽", "福建", "江西", "甘肃", "青海", "广东", "北京", "台湾", "香港",
            "澳门", "贵州", "云南", "西藏", "上海", "浙江", "辽宁", "吉林", "黑龙江", "广西", "海南", "重庆"
    };
    /**
     * 所有省份Id
     */
    public static int[] provinceId = new int[]{
            109000238, 109000380, 109003078, 109000022, 109001499, 109000043, 109001674, 109003404,
            109001868, 109001997, 109000887, 109003372, 109002520, 109001133, 109001273, 109001377,
            109003206, 109003319, 109002147, 109000001, 109003521, 109003522, 109003523, 109002741,
            109002842, 109002996, 109000865, 109001020, 109000502, 109000631, 109000709, 109002309,
            109002447, 109002476
    };

    /**
     * 山西省所有市名称
     */
    public static String[] shanxiName = new String[]{
            "太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁"
    };
    /**
     * 山西省所有市Id
     */
    public static int[] shanxiId = new int[]{
            109000239, 109000251, 109000264, 109000271, 109000286, 109000294, 109000302, 109000315, 109000330, 109000346, 109000365
    };
    /**
     * 山西太原名称
     */
    public static String[] shanxiTaiyuanName = new String[]{
            "市辖区", "小店", "迎泽", "杏花岭", "尖草坪", "万柏林", "晋源", "清徐", "阳曲", "娄烦", "古交"
    };
    /**
     * 山西太原Id
     */
    public static int[] shanxiTaiyuanId = new int[]{
            109000240, 109000241, 109000242, 109000243, 109000244, 109000245, 109000246, 109000247, 109000248, 109000249, 109000250
    };
    /**
     * 山西大同
     */
    public static String[] shanxiDatongName = new String[]{
            "市辖区", "城区", "矿区", "南郊", "新荣", "阳高", "天镇", "广灵", "灵丘", "浑源", "左云", "大同"
    };
    /**
     * 山西大同
     */
    public static int[] shanxiDatongId = new int[]{
            109000252, 109000253, 109000254, 109000255, 109000256, 109000257, 109000258, 109000259, 109000260, 109000261, 109000262, 109000263
    };
    /**
     * 山西阳泉
     */
    public static String[] shanxiYangquanName = new String[]{
            "市辖区", "城区", "矿区", "郊区", "平定", "盂县"
    };
    /**
     * 山西阳泉
     */
    public static int[] shanxiYangquanId = new int[]{
            109000265, 109000266, 109000267, 109000268, 109000269, 109000270
    };
    /**
     * 山西长治
     */
    public static String[] shanxiChangzhiName = new String[]{
            "市辖区", "城区", "郊区", "长治", "襄垣", "屯留", "平顺", "黎城", "壶关", "长子", "武乡", "沁县", "沁源", "潞城"
    };
    /**
     * 山西长治
     */
    public static int[] shanxiChangzhiId = new int[]{
            109000272, 109000273, 109000274, 109000275, 109000276, 109000277, 109000278, 109000279, 109000280, 109000281, 109000282, 109000283, 109000284, 109000285
    };
    /**
     * 山西晋城
     */
    public static String[] shanxiJinchengName = new String[]{
            "市辖区", "城区", "沁水", "阳城", "陵川", "泽州", "高平"
    };
    /**
     * 山西晋城
     */
    public static int[] shanxiJinchengId = new int[]{
            109000287, 109000288, 109000289, 109000290, 109000291, 109000292, 109000293
    };
    /**
     * 山西朔州
     */
    public static String[] shanxiShuozhouName = new String[]{
            "市辖区", "朔城", "平鲁", "山阴", "应县", "右玉", "怀仁"
    };
    /**
     * 山西朔州
     */
    public static int[] shanxiShuozhouId = new int[]{
            109000295, 109000296, 109000297, 109000298, 109000299, 109000300, 109000301
    };
    /**
     * 山西晋中
     */
    public static String[] shanxiJinzhongName = new String[]{
            "市辖区", "榆次", "榆社", "左权", "和顺", "昔阳", "寿阳", "太谷", "祁县", "平遥", "灵石", "介休"
    };
    /**
     * 山西晋中
     */
    public static int[] shanxiJinzhongId = new int[]{
            109000303, 109000304, 109000305, 109000306, 109000307, 109000308, 109000309, 109000310, 109000311, 109000312, 109000313, 109000314
    };
    /**
     * 山西运城
     */
    public static String[] shanxiYunchengName = new String[]{
            "市辖区", "盐湖", "临猗", "万荣", "闻喜", "稷山", "新绛", "绛县", "垣曲", "夏县", "平陆", "芮城", "永济", "河津"
    };
    /**
     * 山西运城
     */
    public static int[] shanxiYunchengId = new int[]{
            109000316, 109000317, 109000318, 109000319, 109000320, 109000321, 109000322, 109000323, 109000324, 109000325, 109000326, 109000327, 109000328, 109000329
    };
    /**
     * 山西忻州
     */
    public static String[] shanxiXinzhouName = new String[]{
            "市辖区", "忻府", "定襄", "五台", "代县", "繁峙", "宁武", "静乐", "神池", "五寨", "岢岚", "河曲", "保德", "偏关", "原平"};
    /**
     * 山西忻州
     */
    public static int[] shanxiXinzhouId = new int[]{
            109000331, 109000332, 109000333, 109000334, 109000335, 109000336, 109000337, 109000338, 109000339, 109000340, 109000341, 109000342, 109000343, 109000344, 109000345};
    /**
     * 山西临汾
     */
    public static String[] shanxiLinfenName = new String[]{
            "市辖区", "尧都", "曲沃", "翼城", "襄汾", "洪洞", "古县", "安泽", "浮山", "吉县", "乡宁", "大宁", "隰县", "永和", "蒲县", "汾西", "侯马", "霍州"};
    /**
     * 山西临汾
     */
    public static int[] shanxiLinfenId = new int[]{
            109000347, 109000348, 109000349, 109000350, 109000351, 109000352, 109000353, 109000354, 109000355, 109000356, 109000357, 109000358, 109000359, 109000360, 109000361, 109000362, 109000363, 109000364};
    /**
     * 山西吕梁
     */
    public static String[] shanxiLvliangName = new String[]{
            "市辖区", "离石", "文水", "交城", "兴县", "临县", "柳林", "石楼", "岚县", "方山", "中阳", "交口", "孝义", "汾阳"};
    /**
     * 山西吕梁
     */
    public static int[] shanxiLvliangId = new int[]{
            109000366, 109000367, 109000368, 109000369, 109000370, 109000371, 109000372, 109000373, 109000374, 109000375, 109000376, 109000377, 109000378, 109000379};
    /**
     * 内蒙古
     */
    public static String[] neimengguName = new String[]{
            "呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安", "锡林郭勒", "阿拉善"
    };
    /**
     * 内蒙古
     */
    public static int[] neimengguId = new int[]{
            109000381, 109000392, 109000403, 109000408, 109000422, 109000432, 109000441, 109000456, 109000465, 109000478, 109000485, 109000498
    };
    /**
     * 内蒙古-呼和浩特
     */
    public static String[] neimengguHuhehaoteName = new String[]{
            "市辖区", "新城", "回民", "玉泉", "赛罕", "土默特左旗", "托克托", "和林格尔", "清水河", "武川"
    };
    /**
     * 内蒙古-呼和浩特
     */
    public static int[] neimengguHuhehaoteId = new int[]{
            109000382, 109000383, 109000384, 109000385, 109000386, 109000387, 109000388, 109000389, 109000390, 109000391
    };
    /**
     * 内蒙古-包头
     */
    public static String[] neimengguBaotouName = new String[]{
            "市辖区", "东河", "昆都仑", "青山", "石拐", "白云矿", "九原", "土默特右旗", "固阳", "达尔罕茂明安联合旗"
    };
    /**
     * 内蒙古-包头
     */
    public static int[] neimengguBaotouId = new int[]{
            109000393, 109000394, 109000395, 109000396, 109000397, 109000398, 109000399, 109000400, 109000401, 109000402
    };
    /**
     * 内蒙古-乌海
     */
    public static String[] neimengguWuhaiName = new String[]{
            "市辖区", "海勃湾", "海南", "乌达"
    };
    /**
     * 内蒙古-乌海
     */
    public static int[] neimengguWuhaiId = new int[]{
            109000404, 109000405, 109000406, 109000407
    };
    /**
     * 内蒙古-赤峰
     */
    public static String[] neimengguChifengName = new String[]{
            "市辖区", "红山", "元宝山", "松山", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城", "敖汉旗"
    };
    /**
     * 内蒙古-赤峰
     */
    public static int[] neimengguChifengId = new int[]{
            109000409, 109000410, 109000411, 109000412, 109000413, 109000414, 109000415, 109000416, 109000417, 109000418, 109000419, 109000420, 109000421
    };
    /**
     * 内蒙古-通辽
     */
    public static String[] neimengguTongliaoName = new String[]{
            "市辖区", "科尔沁", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁", "库伦旗", "奈曼旗", "扎鲁特旗", "霍林郭勒"
    };
    /**
     * 内蒙古-通辽
     */
    public static int[] neimengguTongliaoId = new int[]{
            109000423, 109000424, 109000425, 109000426, 109000427, 109000428, 109000429, 109000430, 109000431
    };
    /**
     * 内蒙古-鄂尔多斯
     */
    public static String[] neimengguEerduosiName = new String[]{
            "东胜", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"
    };
    /**
     * 内蒙古-鄂尔多斯
     */
    public static int[] neimengguEerduosiId = new int[]{
            109000433, 109000434, 109000435, 109000436, 109000437, 109000438, 109000439, 109000440
    };
    /**
     * 内蒙古-呼伦贝尔
     */
    public static String[] neimengguHulunbeierName = new String[]{
            "市辖区", "海拉尔", "阿荣旗", "莫力达瓦达斡尔族自治", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里", "牙克石", "扎兰屯", "额尔古纳", "根河"
    };
    /**
     * 内蒙古-呼伦贝尔
     */
    public static int[] neimengguHulunbeierId = new int[]{
            109000442, 109000443, 109000444, 109000445, 109000446, 109000447, 109000448, 109000449, 109000450, 109000451, 109000452, 109000453, 109000454, 109000455
    };
    /**
     * 内蒙古-巴彦淖尔
     */
    public static String[] neimengguBayanzhuoerName = new String[]{
            "市辖区", "临河", "五原", "磴口", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"
    };
    /**
     * 内蒙古-巴彦淖尔
     */
    public static int[] neimengguBayanzhuoerId = new int[]{
            109000457, 109000458, 109000459, 109000460, 109000461, 109000462, 109000463, 109000464
    };
    /**
     * 内蒙古-乌兰察布
     */
    public static String[] neimengguWulanchabuName = new String[]{
            "市辖区", "集宁", "卓资", "化德", "商都", "兴和", "凉城", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇"
    };
    /**
     * 内蒙古-乌兰察布
     */
    public static int[] neimengguWulanchabuId = new int[]{
            109000466, 109000467, 109000468, 109000469, 109000470, 109000471, 109000472, 109000473, 109000474, 109000475, 109000476, 109000477
    };
    /**
     * 内蒙古-兴安
     */
    public static String[] neimengguXinganName = new String[]{
            "乌兰浩特", "阿尔山", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉"
    };
    /**
     * 内蒙古-兴安
     */
    public static int[] neimengguXinganId = new int[]{
            109000479, 109000480, 109000481, 109000482, 109000483, 109000484
    };
    /**
     * 内蒙古-锡林郭勒
     */
    public static String[] neimengguXilinguoleName = new String[]{
            "二连浩特", "锡林浩特", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦"
    };
    /**
     * 内蒙古-锡林郭勒
     */
    public static int[] neimengguXilinguoleId = new int[]{
            109000486, 109000487, 109000488, 109000489, 109000490, 109000491, 109000492, 109000493, 109000494, 109000495, 109000496, 109000497
    };
    /**
     * 内蒙古-阿拉善
     */
    public static String[] neimengguAlashanName = new String[]{
            "阿拉善左旗", "阿拉善右旗", "额济纳旗"
    };
    /**
     * 内蒙古-阿拉善
     */
    public static int[] neimengguAlashanId = new int[]{
            109000499, 109000500, 109000501
    };
    /**
     * 陕西
     */
    public static String[] shanbeiName = new String[]{
            "西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"
    };
    /**
     * 陕西
     */
    public static int[] shanbeiId = new int[]{
            109003079, 109003094, 109003100, 109003114, 109003130, 109003143, 109003158, 109003171, 109003185, 109003197
    };
    /**
     * 陕西-西安
     */
    public static String[] shanbeiXianName = new String[]{
            "市辖区", "新城", "碑林", "莲湖", "灞桥", "未央", "雁塔", "阎良", "临潼", "长安", "蓝田", "周至", "户县", "高陵"
    };
    /**
     * 陕西-西安
     */
    public static int[] shanbeiXianId = new int[]{
            109003080, 109003081, 109003082, 109003083, 109003084, 109003085, 109003086, 109003087, 109003088, 109003089, 109003090, 109003091, 109003092, 109003093
    };
    /**
     * 陕西-铜川
     */
    public static String[] shanbeiTongchuanName = new String[]{
            "市辖区", "王益", "印台", "耀州", "宜君"
    };
    /**
     * 陕西-铜川
     */
    public static int[] shanbeiTongchuanId = new int[]{
            109003095, 109003096, 109003097, 109003098, 109003099
    };
    /**
     * 陕西-宝鸡
     */
    public static String[] shanbeiBaojiName = new String[]{
            "市辖区", "渭滨", "金台", "陈仓", "凤翔", "岐山", "扶风", "眉县", "陇县", "千阳", "麟游", "凤县", "太白"
    };
    /**
     * 陕西-宝鸡
     */
    public static int[] shanbeiBaojiId = new int[]{
            109003101, 109003102, 109003103, 109003104, 109003105, 109003106, 109003107, 109003108, 109003109, 109003110, 109003111, 109003112, 109003113
    };
    /**
     * 陕西-咸阳
     */
    public static String[] shanbeiXianyangName = new String[]{
            "市辖区", "秦都", "杨凌", "渭城", "三原", "泾阳", "乾县", "礼泉", "永寿", "彬县", "长武", "旬邑", "淳化", "武功", "兴平"
    };
    /**
     * 陕西-咸阳
     */
    public static int[] shanbeiXianyangId = new int[]{
            109003115, 109003116, 109003117, 109003118, 109003119, 109003120, 109003121, 109003122, 109003123, 109003124, 109003125, 109003126, 109003127, 109003128, 109003129
    };
    /**
     * 陕西-渭南
     */
    public static String[] shanbeiWeinanName = new String[]{
            "市辖区", "临渭", "华县", "潼关", "大荔", "合阳", "澄城", "蒲城", "白水", "富平", "韩城", "华阴"
    };
    /**
     * 陕西-渭南
     */
    public static int[] shanbeiWeinanId = new int[]{
            109003131, 109003132, 109003133, 109003134, 109003135, 109003136, 109003137, 109003138, 109003139, 109003140, 109003141, 109003142
    };
    /**
     * 陕西-延安
     */
    public static String[] shanbeiYananName = new String[]{
            "市辖区", "宝塔", "延长", "延川", "子长", "安塞", "志丹", "吴旗", "甘泉", "富县", "洛川", "宜川", "黄龙", "黄陵"
    };
    /**
     * 陕西-延安
     */
    public static int[] shanbeiYananId = new int[]{
            109003144, 109003145, 109003146, 109003147, 109003148, 109003149, 109003150, 109003151, 109003152, 109003153, 109003154, 109003155, 109003156, 109003157
    };
    /**
     * 陕西-汉中
     */
    public static String[] shanbeiHanzhongName = new String[]{
            "市辖区", "汉台", "南郑", "城固", "洋县", "西乡", "勉县", "宁强", "略阳", "镇巴", "留坝", "佛坪"
    };
    /**
     * 陕西-汉中
     */
    public static int[] shanbeiHanzhongId = new int[]{
            109003159, 109003160, 109003161, 109003162, 109003163, 109003164, 109003165, 109003166, 109003167, 109003168, 109003169, 109003170
    };
    /**
     * 陕西-榆林
     */
    public static String[] shanbeiYulinName = new String[]{
            "市辖区", "榆阳", "神木", "府谷", "横山", "靖边", "定边", "绥德", "米脂", "佳县", "吴堡", "清涧", "子洲"
    };
    /**
     * 陕西-榆林
     */
    public static int[] shanbeiYulinId = new int[]{
            109003172, 109003173, 109003174, 109003175, 109003176, 109003177, 109003178, 109003179, 109003180, 109003181, 109003182, 109003183, 109003184
    };
    /**
     * 陕西-安康
     */
    public static String[] shanbeiAnkangName = new String[]{
            "市辖区", "汉滨", "汉阴", "石泉", "宁陕", "紫阳", "岚皋", "平利", "镇坪", "旬阳", "白河"
    };
    /**
     * 陕西-安康
     */
    public static int[] shanbeiAnkangId = new int[]{
            109003186, 109003187, 109003188, 109003189, 109003190, 109003191, 109003192, 109003193, 109003194, 109003195, 109003196
    };
    /**
     * 陕西-商洛
     */
    public static String[] shanbeiShangluoName = new String[]{
            "市辖区", "商州", "洛南", "丹凤", "商南", "山阳", "镇安", "柞水"
    };
    /**
     * 陕西-商洛
     */
    public static int[] shanbeiShangluoId = new int[]{
            109003198, 109003199, 109003200, 109003201, 109003202, 109003203, 109003204, 109003205
    };
    /**
     * 天津
     */
    public static String[] tianjinName = new String[]{
            "市区", "县区"
    };
    /**
     * 天津
     */
    public static int[] tianjinId = new int[]{
            109000023, 109000039
    };
    /**
     * 天津-市区
     */
    public static String[] tianjinShiquName = new String[]{
            "和平","河东","河西","南开","河北","红桥","塘沽","汉沽","大港","东丽","西青","津南","北辰","武清","宝坻", "天津港"
    };
    /**
     * 天津-市区
     */
    public static int[] tianjinShiquId = new int[]{
            109000024,
            109000025,
            109000026,
            109000027,
            109000028,
            109000029,
            109000030,
            109000031,
            109000032,
            109000033,
            109000034,
            109000035,
            109000036,
            109000037,
            109000038,
            109003524
    };
    /**
     * 天津-县区
     */
    public static String[] tianjinXianquName = new String[]{
            "宁河",
            "静海",
            "蓟县"
    };
    /**
     * 天津-县区
     */
    public static int[] tianjinXianquId = new int[]{
            109000040,
            109000041,
            109000042
    };
    /**
     * 山东
     */
    public static String[] shandongName = new String[]{
            "济南",
            "青岛",
            "淄博",
            "枣庄",
            "东营",
            "烟台",
            "潍坊",
            "济宁",
            "泰安",
            "威海",
            "日照",
            "莱芜",
            "临沂",
            "德州",
            "聊城",
            "滨州",
            "荷泽"
    };
    /**
     * 山东
     */
    public static int[] shandongId = new int[]{
            109001500,
            109001512,
            109001526,
            109001536,
            109001544,
            109001551,
            109001565,
            109001579,
            109001593,
            109001601,
            109001607,
            109001613,
            109001617,
            109001631,
            109001644,
            109001654,
            109001663
    };
    /**
     * 山东-济南
     */
    public static String[] shandongJinanName = new String[]{
            "市辖区",
            "历下",
            "市中",
            "槐荫",
            "天桥",
            "历城",
            "长清",
            "平阴",
            "济阳",
            "商河",
            "章丘"
    };
    /**
     * 山东-济南
     */
    public static int[] shandongJinanId = new int[]{
            109001501,
            109001502,
            109001503,
            109001504,
            109001505,
            109001506,
            109001507,
            109001508,
            109001509,
            109001510,
            109001511
    };
    /**
     * 山东-青岛
     */
    public static String[] shandongQingdaoName = new String[]{
            "市辖区",
            "市南",
            "市北",
            "四方",
            "黄岛",
            "崂山",
            "李沧",
            "城阳",
            "胶州",
            "即墨",
            "平度",
            "胶南",
            "莱西"
    };
    /**
     * 山东-青岛
     */
    public static int[] shandongQingdaoId = new int[]{
            109001513,
            109001514,
            109001515,
            109001516,
            109001517,
            109001518,
            109001519,
            109001520,
            109001521,
            109001522,
            109001523,
            109001524,
            109001525
    };
    /**
     * 山东-淄博
     */
    public static String[] shandongZiboName = new String[]{
            "市辖区",
            "淄川",
            "张店",
            "博山",
            "临淄",
            "周村",
            "桓台",
            "高青",
            "沂源"
    };
    /**
     * 山东-淄博
     */
    public static int[] shandongZiboId = new int[]{
            109001527,
            109001528,
            109001529,
            109001530,
            109001531,
            109001532,
            109001533,
            109001534,
            109001535
    };
    /**
     * 山东-枣庄
     */
    public static String[] shandongZaozhuangName = new String[]{
                    "市辖区",
                    "市中",
                    "薛城",
                    "峄城",
                    "台儿庄",
                    "山亭",
                    "滕州"
            };
    /**
     * 山东-枣庄
     */
    public static int[] shandongZaozhuangId = new int[]{
            109001537,
            109001538,
            109001539,
            109001540,
            109001541,
            109001542,
            109001543
    };
    /**
     * 山东-东营
     */
    public static String[] shandongDongyingName = new String[]{
            "市辖区",
            "东营",
            "河口",
            "垦利",
            "利津",
            "广饶"
    };
    /**
     * 山东-东营
     */
    public static int[] shandongDongyingId = new int[]{
            109001545,
            109001546,
            109001547,
            109001548,
            109001549,
            109001550
    };
    /**
     * 山东-烟台
     */
    public static String[] shandongYantaiName = new String[]{
            "市辖区",
            "芝罘",
            "福山",
            "牟平",
            "莱山",
            "长岛",
            "龙口",
            "莱阳",
            "莱州",
            "蓬莱",
            "招远",
            "栖霞",
            "海阳"
    };
    /**
     * 山东-烟台
     */
    public static int[] shandongYantaiId = new int[]{
            109001552,
            109001553,
            109001554,
            109001555,
            109001556,
            109001557,
            109001558,
            109001559,
            109001560,
            109001561,
            109001562,
            109001563,
            109001564
    };
    /**
     * 山东-潍坊
     */
    public static String[] shandongWeifangName = new String[]{
            "市辖区",
            "潍城",
            "寒亭",
            "坊子",
            "奎文",
            "临朐",
            "昌乐",
            "青州",
            "诸城",
            "寿光",
            "安丘",
            "高密",
            "昌邑"
    };
    /**
     * 山东-潍坊
     */
    public static int[] shandongWeifangId = new int[]{
            109001566,
            109001567,
            109001568,
            109001569,
            109001570,
            109001571,
            109001572,
            109001573,
            109001574,
            109001575,
            109001576,
            109001577,
            109001578
    };
    /**
     * 山东-济宁
     */
    public static String[] shandongJiningName = new String[]{
            "市辖区",
            "市中",
            "任城",
            "微山",
            "鱼台",
            "金乡",
            "嘉祥",
            "汶上",
            "泗水",
            "梁山",
            "曲阜",
            "兖州",
            "邹城",
    };
    /**
     * 山东-济宁
     */
    public static int[] shandongJiningId = new int[]{
            109001580,
            109001581,
            109001582,
            109001583,
            109001584,
            109001585,
            109001586,
            109001587,
            109001588,
            109001589,
            109001590,
            109001591,
            109001592
    };
    /**
     * 山东-泰安
     */
    public static String[] shandongTaianName = new String[]{
            "市辖区",
            "泰山",
            "岱岳",
            "宁阳",
            "东平",
            "新泰",
            "肥城",
    };
    /**
     * 山东-泰安
     */
    public static int[] shandongTaianId = new int[]{
            109001594,
            109001595,
            109001596,
            109001597,
            109001598,
            109001599,
            109001600
    };
    /**
     * 山东-威海
     */
    public static String[] shandongWeihaiName = new String[]{
            "市辖区",
            "环翠",
            "文登",
            "荣成",
            "乳山",
    };
    /**
     * 山东-威海
     */
    public static int[] shandongWeihaiId = new int[]{
            109001602,
            109001603,
            109001604,
            109001605,
            109001606
    };
    /**
     * 山东-日照
     */
    public static String[] shandongRizhaoName = new String[]{
            "市辖区",
            "东港",
            "岚山",
            "五莲",
            "莒县",
    };
    /**
     * 山东-日照
     */
    public static int[] shandongRizhaoId = new int[]{
            109001608,
            109001609,
            109001610,
            109001611,
            109001612
    };
    /**
     * 山东-莱芜
     */
    public static String[] shandongLaiwuName = new String[]{
            "市辖区",
            "莱城",
            "钢城",
    };
    /**
     * 山东-莱芜
     */
    public static int[] shandongLaiwuId = new int[]{
            109001614,
            109001615,
            109001616
    };
    /**
     * 山东-临沂
     */
    public static String[] shandongLinyiName = new String[]{
            "市辖区",
            "兰山",
            "罗庄",
            "河东",
            "沂南",
            "郯城",
            "沂水",
            "苍山",
            "费县",
            "平邑",
            "莒南",
            "蒙阴",
            "临沭"
    };
    /**
     * 山东-临沂
     */
    public static int[] shandongLinyiId = new int[]{
            109001618,
            109001619,
            109001620,
            109001621,
            109001622,
            109001623,
            109001624,
            109001625,
            109001626,
            109001627,
            109001628,
            109001629,
            109001630
    };
    /**
     * 山东-德州
     */
    public static String[] shandongDezhouName = new String[]{
            "市辖区",
            "德城",
            "陵县",
            "宁津",
            "庆云",
            "临邑",
            "齐河",
            "平原",
            "夏津",
            "武城",
            "乐陵",
            "禹城"
    };
    /**
     * 山东-德州
     */
    public static int[] shandongDezhouId = new int[]{
            109001632,
            109001633,
            109001634,
            109001635,
            109001636,
            109001637,
            109001638,
            109001639,
            109001640,
            109001641,
            109001642,
            109001643
    };
    /**
     * 山东-聊城
     */
    public static String[] shandongLiaochengName = new String[]{
            "市辖区",
            "东昌府",
            "阳谷",
            "莘县",
            "茌平",
            "东阿",
            "冠县",
            "高唐",
            "临清"
    };
    /**
     * 山东-聊城
     */
    public static int[] shandongLiaochengId = new int[]{
            109001645,
            109001646,
            109001647,
            109001648,
            109001649,
            109001650,
            109001651,
            109001652,
            109001653
    };
    /**
     * 山东-滨州
     */
    public static String[] shandongBinzhouName = new String[]{
            "市辖区",
            "滨城",
            "惠民",
            "阳信",
            "无棣",
            "沾化",
            "博兴",
            "邹平"
    };
    /**
     * 山东-滨州
     */
    public static int[] shandongBinzhouId = new int[]{
            109001655,
            109001656,
            109001657,
            109001658,
            109001659,
            109001660,
            109001661,
            109001662
    };
    /**
     * 山东-菏泽
     */
    public static String[] shandongHezeName = new String[]{
            "市辖区",
            "牡丹",
            "曹县",
            "单县",
            "成武",
            "巨野",
            "郓城",
            "鄄城",
            "定陶",
            "东明"
    };
    /**
     * 山东-菏泽
     */
    public static int[] shandongHezeId = new int[]{
            109001664,
            109001665,
            109001666,
            109001667,
            109001668,
            109001669,
            109001670,
            109001671,
            109001672,
            109001673
    };
    /**
     * 河北
     */
    public static String[] hebeiName = new String[]{
            "石家庄",
            "唐山",
            "秦皇岛",
            "邯郸",
            "邢台",
            "保定",
            "张家口",
            "承德",
            "沧州",
            "廊坊",
            "衡水"
    };
    /**
     * 河北
     */
    public static int[] hebeiId = new int[]{
            109000044,
            109000069,
            109000085,
            109000094,
            109000115,
            109000136,
            109000163,
            109000182,
            109000195,
            109000213,
            109000225
    };


    /**
     * 河北-石家庄
     */
    public static String[] hebeiShijiazhuangName = new String[]{
            "市辖区",
            "长安",
            "桥东",
            "桥西",
            "新华",
            "井陉矿",
            "裕华",
            "井陉",
            "正定",
            "栾城",
            "行唐",
            "灵寿",
            "高邑",
            "深泽",
            "赞皇",
            "无极",
            "平山",
            "元氏",
            "赵县",
            "辛集",
            "藁城",
            "晋州",
            "新乐",
            "鹿泉"
    };
    /**
     * 河北-石家庄
     */
    public static int[] hebeiShijiazhuangId = new int[]{
            109000045,
            109000046,
            109000047,
            109000048,
            109000049,
            109000050,
            109000051,
            109000052,
            109000053,
            109000054,
            109000055,
            109000056,
            109000057,
            109000058,
            109000059,
            109000060,
            109000061,
            109000062,
            109000063,
            109000064,
            109000065,
            109000066,
            109000067,
            109000068
    };
    /**
     * 河北-唐山
     */
    public static String[] hebeiTangshanName = new String[]{
            "市辖区",
            "路南",
            "路北",
            "古冶",
            "开平",
            "丰南",
            "丰润",
            "滦县",
            "滦南",
            "乐亭",
            "迁西",
            "玉田",
            "唐海",
            "遵化",
            "迁安"
    };
    /**
     * 河北-唐山
     */
    public static int[] hebeiTangshanId = new int[]{
            109000070,
            109000071,
            109000072,
            109000073,
            109000074,
            109000075,
            109000076,
            109000077,
            109000078,
            109000079,
            109000080,
            109000081,
            109000082,
            109000083,
            109000084
    };

    /**
     * 河北- 秦皇岛
     */
    public static String[] hebeiQinhuandaoName = new String[]{
            "市辖区",
            "海港",
            "山海关",
            "北戴河",
            "青龙",
            "昌黎",
            "抚宁",
            "卢龙"
    };
    /**
     * 河北- 秦皇岛
     */
    public static int[] hebeiQinhuandaoId = new int[]{
            109000086,
            109000087,
            109000088,
            109000089,
            109000090,
            109000091,
            109000092,
            109000093,
    };
    /**
     * 河北- 邯郸
     */
    public static String[] hebeiHandanName = new String[]{
            "市辖区",
            "邯山",
            "丛台",
            "复兴",
            "峰峰矿",
            "邯郸",
            "临漳",
            "成安",
            "大名",
            "涉县",
            "磁县",
            "肥乡",
            "永年",
            "邱县",
            "鸡泽",
            "广平",
            "馆陶",
            "魏县",
            "曲周",
            "武安"
    };
    /**
     * 河北- 邯郸
     */
    public static int[] hebeiHandanId = new int[]{
            109000095,
            109000096,
            109000097,
            109000098,
            109000099,
            109000100,
            109000101,
            109000102,
            109000103,
            109000104,
            109000105,
            109000106,
            109000107,
            109000108,
            109000109,
            109000110,
            109000111,
            109000112,
            109000113,
            109000114
    };
    /**
     * 河北- 邢台
     */
    public static String[] hebeiXingtaiName = new String[]{
            "市辖区",
            "桥东",
            "桥西",
            "邢台",
            "临城",
            "内丘",
            "柏乡",
            "隆尧",
            "任县",
            "南和",
            "宁晋",
            "巨鹿",
            "新河",
            "广宗",
            "平乡",
            "威县",
            "清河",
            "临西",
            "南宫",
            "沙河"
    };
    /**
     * 河北- 邢台
     */
    public static int[] hebeiXingtaiId = new int[]{
            109000116,
            109000117,
            109000118,
            109000119,
            109000120,
            109000121,
            109000122,
            109000123,
            109000124,
            109000125,
            109000126,
            109000127,
            109000128,
            109000129,
            109000130,
            109000131,
            109000132,
            109000133,
            109000134,
            109000135
    };
    /**
     * 河北- 保定
     */
    public static String[] hebeiBaodingName = new String[]{
            "市辖区",
            "新市",
            "北市",
            "南市",
            "满城",
            "清苑",
            "涞水",
            "阜平",
            "徐水",
            "定兴",
            "唐县",
            "高阳",
            "容城",
            "涞源",
            "望都",
            "安新",
            "易县",
            "曲阳",
            "蠡县",
            "顺平",
            "博野",
            "雄县",
            "涿州",
            "定州",
            "安国",
            "高碑店"
    };
    /**
     * 河北- 保定
     */
    public static int[] hebeiBaodingId = new int[]{
            109000137,
            109000138,
            109000139,
            109000140,
            109000141,
            109000142,
            109000143,
            109000144,
            109000145,
            109000146,
            109000147,
            109000148,
            109000149,
            109000150,
            109000151,
            109000152,
            109000153,
            109000154,
            109000155,
            109000156,
            109000157,
            109000158,
            109000159,
            109000160,
            109000161,
            109000162
    };
    /**
     * 河北- 张家口
     */
    public static String[] hebeiZhangjiakouName = new String[]{
            "市辖区",
            "桥东",
            "桥西",
            "宣化",
            "下花园",
            "宣化",
            "张北",
            "康保",
            "沽源",
            "尚义",
            "蔚县",
            "阳原",
            "怀安",
            "万全",
            "怀来",
            "涿鹿",
            "赤城",
            "崇礼"
    };
    /**
     * 河北- 张家口
     */
    public static int[] hebeiZhangjiakouId = new int[]{
            109000164,
            109000165,
            109000166,
            109000167,
            109000168,
            109000169,
            109000170,
            109000171,
            109000172,
            109000173,
            109000174,
            109000175,
            109000176,
            109000177,
            109000178,
            109000179,
            109000180,
            109000181
    };
    /**
     * 河北- 承德
     */
    public static String[] hebeiChengdeName = new String[]{
            "市辖区",
            "双桥",
            "双滦",
            "鹰手营",
            "承德",
            "兴隆",
            "平泉",
            "滦平",
            "隆化",
            "丰宁",
            "宽城",
            "围场"
    };
    /**
     * 河北- 承德
     */
    public static int[] hebeiChengdeId = new int[]{
            109000183,
            109000184,
            109000185,
            109000186,
            109000187,
            109000188,
            109000189,
            109000190,
            109000191,
            109000192,
            109000193,
            109000194
    };
    /**
     * 河北- 沧州
     */
    public static String[] hebeiCangzhouName = new String[]{
            "市辖区",
            "新华",
            "运河",
            "沧县",
            "青县",
            "东光",
            "海兴",
            "盐山",
            "肃宁",
            "南皮",
            "吴桥",
            "献县",
            "孟村",
            "泊头",
            "任丘",
            "黄骅",
            "河间"
    };
    /**
     * 河北- 沧州
     */
    public static int[] hebeiCangzhouId = new int[]{
            109000196,
            109000197,
            109000198,
            109000199,
            109000200,
            109000201,
            109000202,
            109000203,
            109000204,
            109000205,
            109000206,
            109000207,
            109000208,
            109000209,
            109000210,
            109000211,
            109000212
    };
    /**
     * 河北- 廊坊
     */
    public static String[] hebeiLangfangName = new String[]{
            "市辖区",
            "安次",
            "广阳",
            "固安",
            "永清",
            "香河",
            "大城",
            "文安",
            "大厂",
            "霸州",
            "三河"
    };
    /**
     * 河北- 廊坊
     */
    public static int[] hebeiLangfangId = new int[]{
            109000214,
            109000215,
            109000216,
            109000217,
            109000218,
            109000219,
            109000220,
            109000221,
            109000222,
            109000223,
            109000224
    };
    /**
     * 河北- 衡水
     */
    public static String[] hebeiHengshuiName = new String[]{
            "市辖区",
            "桃城",
            "枣强",
            "武邑",
            "武强",
            "饶阳",
            "安平",
            "故城",
            "景县",
            "阜城",
            "冀州",
            "深州"
    };
    /**
     * 河北- 衡水
     */
    public static int[] hebeiHengshuiId = new int[]{
            109000226,
            109000227,
            109000228,
            109000229,
            109000230,
            109000231,
            109000232,
            109000233,
            109000234,
            109000235,
            109000236,
            109000237
    };
    /**
     * 河南
     */
    public static String[] henanName = new String[]{
            "郑州",
            "开封",
            "洛阳",
            "平顶山",
            "安阳",
            "鹤壁",
            "新乡",
            "焦作",
            "濮阳",
            "许昌",
            "漯河",
            "三门峡",
            "南阳",
            "商丘",
            "信阳",
            "周口",
            "驻马店"
    };
    /**
     * 河南
     */
    public static int[] henanId = new int[]{
            109001675,
            109001689,
            109001701,
            109001718,
            109001730,
            109001741,
            109001748,
            109001762,
            109001775,
            109001783,
            109001791,
            109001798,
            109001806,
            109001821,
            109001832,
            109001844,
            109001856
    };
    /**
     * 河南-郑州
     */
    public static String[] henanZhengzhouName = new String[]{
            "市辖区",
            "中原",
            "二七",
            "管城",
            "金水",
            "上街",
            "惠济",
            "中牟",
            "巩义",
            "荥阳",
            "新密",
            "新郑",
            "登封"
    };
    /**
     * 河南-郑州
     */
    public static int[] henanZhengzhouId = new int[]{
            109001676,
            109001677,
            109001678,
            109001679,
            109001680,
            109001681,
            109001682,
            109001683,
            109001684,
            109001685,
            109001686,
            109001687,
            109001688
    };
    /**
     * 河南-开封
     */
    public static String[] henanKaifengName = new String[]{
            "市辖区",
            "龙亭",
            "顺河",
            "鼓楼",
            "南关",
            "郊区",
            "杞县",
            "通许",
            "尉氏",
            "开封",
            "兰考"
    };
    /**
     * 河南-开封
     */
    public static int[] henanKaifengId = new int[]{
            109001690,
            109001691,
            109001692,
            109001693,
            109001694,
            109001695,
            109001696,
            109001697,
            109001698,
            109001699,
            109001700
    };
    /**
     * 河南-洛阳
     */
    public static String[] henanLuoyangName = new String[]{
            "市辖区",
            "老城",
            "西工",
            "廛河",
            "涧西",
            "吉利",
            "洛龙",
            "孟津",
            "新安",
            "栾川",
            "嵩县",
            "汝阳",
            "宜阳",
            "洛宁",
            "伊川",
            "偃师"
    };
    /**
     * 河南-洛阳
     */
    public static int[] henanLuoyangId = new int[]{
            109001702,
            109001703,
            109001704,
            109001705,
            109001706,
            109001707,
            109001708,
            109001709,
            109001710,
            109001711,
            109001712,
            109001713,
            109001714,
            109001715,
            109001716,
            109001717
    };
    /**
     * 河南-平顶山
     */
    public static String[] henanPingdingshanName = new String[]{
            "市辖区",
            "新华",
            "卫东",
            "石龙",
            "湛河",
            "宝丰",
            "叶县",
            "鲁山",
            "郏县",
            "舞钢",
            "汝州"
    };
    /**
     * 河南-平顶山
     */
    public static int[] henanPingdingshanId = new int[]{
            109001719,
            109001720,
            109001721,
            109001722,
            109001723,
            109001724,
            109001725,
            109001726,
            109001727,
            109001728,
            109001729
    };
    /**
     * 河南-安阳
     */
    public static String[] henanAnyangName = new String[]{
            "市辖区",
            "文峰",
            "北关",
            "殷都",
            "龙安",
            "安阳",
            "汤阴",
            "滑县",
            "内黄",
            "林州"
    };
    /**
     * 河南-安阳
     */
    public static int[] henanAnyangId = new int[]{
            109001731,
            109001732,
            109001733,
            109001734,
            109001735,
            109001736,
            109001737,
            109001738,
            109001739,
            109001740
    };
    /**
     * 河南-鹤壁
     */
    public static String[] henanHebiName = new String[]{
            "市辖区",
            "鹤山",
            "山城",
            "淇滨",
            "浚县",
            "淇县"
    };
    /**
     * 河南-鹤壁
     */
    public static int[] henanHebiId = new int[]{
            109001742,
            109001743,
            109001744,
            109001745,
            109001746,
            109001747
    };
    /**
     * 河南-新乡
     */
    public static String[] henanXinxiangName = new String[]{
            "市辖区",
            "红旗",
            "卫滨",
            "凤泉",
            "牧野",
            "新乡",
            "获嘉",
            "原阳",
            "延津",
            "封丘",
            "长垣",
            "卫辉",
            "辉县"
    };
    /**
     * 河南-新乡
     */
    public static int[] henanXinxiangId = new int[]{
            109001749,
            109001750,
            109001751,
            109001752,
            109001753,
            109001754,
            109001755,
            109001756,
            109001757,
            109001758,
            109001759,
            109001760,
            109001761
    };
    /**
     * 河南-焦作
     */
    public static String[] henanJiaozuoName = new String[]{
            "市辖区",
            "解放",
            "中站",
            "马村",
            "山阳",
            "修武",
            "博爱",
            "武陟",
            "温县",
            "济源",
            "沁阳",
            "孟州"
    };
    /**
     * 河南-焦作
     */
    public static int[] henanJiaozuoId = new int[]{
            109001763,
            109001764,
            109001765,
            109001766,
            109001767,
            109001768,
            109001769,
            109001770,
            109001771,
            109001772,
            109001773,
            109001774
    };
    /**
     * 河南-濮阳
     */
    public static String[] henanPuyangName = new String[]{
            "市辖区",
            "华龙",
            "清丰",
            "南乐",
            "范县",
            "台前",
            "濮阳"
    };
    /**
     * 河南-濮阳
     */
    public static int[] henanPuyangId = new int[]{
            109001776,
            109001777,
            109001778,
            109001779,
            109001780,
            109001781,
            109001782
    };
    /**
     * 河南-许昌
     */
    public static String[] henanXuchangName = new String[]{
            "市辖区",
            "魏都",
            "许昌",
            "鄢陵",
            "襄城",
            "禹州",
            "长葛"
    };
    /**
     * 河南-许昌
     */
    public static int[] henanXuchangId = new int[]{
            109001784,
            109001785,
            109001786,
            109001787,
            109001788,
            109001789,
            109001790
    };
    /**
     * 河南-漯河
     */
    public static String[] henanLuoheName = new String[]{
            "市辖区",
            "源汇",
            "郾城",
            "召陵",
            "舞阳",
            "临颍"
    };
    /**
     * 河南-漯河
     */
    public static int[] henanLuoheId = new int[]{
            109001792,
            109001793,
            109001794,
            109001795,
            109001796,
            109001797
    };
    /**
     * 河南-三门峡
     */
    public static String[] henanSanmenxiaName = new String[]{
            "市辖区",
            "湖滨",
            "渑池",
            "陕县",
            "卢氏",
            "义马",
            "灵宝"
    };
    /**
     * 河南-三门峡
     */
    public static int[] henanSanmenxiaId = new int[]{
            109001799,
            109001800,
            109001801,
            109001802,
            109001803,
            109001804,
            109001805
    };
    /**
     * 河南-南阳
     */
    public static String[] henanNanyangName = new String[]{
            "市辖区",
            "宛城",
            "卧龙",
            "南召",
            "方城",
            "西峡",
            "镇平",
            "内乡",
            "淅川",
            "社旗",
            "唐河",
            "新野",
            "桐柏",
            "邓州"
    };
    /**
     * 河南-南阳
     */
    public static int[] henanNanyangId = new int[]{
            109001807,
            109001808,
            109001809,
            109001810,
            109001811,
            109001812,
            109001813,
            109001814,
            109001815,
            109001816,
            109001817,
            109001818,
            109001819,
            109001820
    };
    /**
     * 河南-商丘
     */
    public static String[] henanShangqiuName = new String[]{
            "市辖区",
            "梁园",
            "睢阳",
            "民权",
            "睢县",
            "宁陵",
            "柘城",
            "虞城",
            "夏邑",
            "永城"
    };
    /**
     * 河南-商丘
     */
    public static int[] henanShangqiuId = new int[]{
            109001822,
            109001823,
            109001824,
            109001825,
            109001826,
            109001827,
            109001828,
            109001829,
            109001830,
            109001831
    };
    /**
     * 河南-信阳
     */
    public static String[] henanXinyangName = new String[]{
            "市辖区",
            "浉河",
            "平桥",
            "罗山",
            "光山",
            "新县",
            "商城",
            "固始",
            "潢川",
            "淮滨",
            "息县"
    };
    /**
     * 河南-信阳
     */
    public static int[] henanXinyangId = new int[]{
            109001833,
            109001834,
            109001835,
            109001836,
            109001837,
            109001838,
            109001839,
            109001840,
            109001841,
            109001842,
            109001843
    };
    /**
     * 河南-周口
     */
    public static String[] henanZhoukouName = new String[]{
            "市辖区",
            "川汇",
            "扶沟",
            "西华",
            "商水",
            "沈丘",
            "郸城",
            "淮阳",
            "太康",
            "鹿邑",
            "项城"
    };
    /**
     * 河南-周口
     */
    public static int[] henanZhoukouId = new int[]{
            109001845,
            109001846,
            109001847,
            109001848,
            109001849,
            109001850,
            109001851,
            109001852,
            109001853,
            109001854,
            109001855
    };
    /**
     * 河南-驻马店
     */
    public static String[] henanZhumadianName = new String[]{
            "市辖区",
            "驿城",
            "西平",
            "上蔡",
            "平舆",
            "正阳",
            "确山",
            "泌阳",
            "汝南",
            "遂平",
            "新蔡"
    };
    /**
     * 河南-驻马店
     */
    public static int[] henanZhumadianId = new int[]{
            109001857,
            109001858,
            109001859,
            109001860,
            109001861,
            109001862,
            109001863,
            109001864,
            109001865,
            109001866,
            109001867
    };
    /**
     * 新疆
     */
    public static String[] xinjiangName = new String[]{
            "乌鲁木齐",
            "克拉玛依",
            "吐鲁番",
            "哈密",
            "昌吉",
            "博尔塔拉",
            "巴音郭楞",
            "阿克苏",
            "克孜勒苏",
            "喀什",
            "和田",
            "伊犁",
            "塔城",
            "阿勒泰",
            "省直辖"
    };
    /**
     * 新疆
     */
    public static int[] xinjiangId = new int[]{
            109003405,
            109003415,
            109003421,
            109003425,
            109003429,
            109003438,
            109003442,
            109003452,
            109003462,
            109003467,
            109003480,
            109003489,
            109003500,
            109003508,
            109003516
    };
    /**
     * 新疆-乌鲁木齐
     */
    public static String[] xinjiangWulumuqiName = new String[]{
            "市辖区",
            "天山",
            "沙依巴克",
            "新市",
            "水磨沟",
            "头屯河",
            "达坂城",
            "东山",
            "乌鲁木齐"
    };
    /**
     * 新疆-乌鲁木齐
     */
    public static int[] xinjiangWulumuqiId = new int[]{
            109003406,
            109003407,
            109003408,
            109003409,
            109003410,
            109003411,
            109003412,
            109003413,
            109003414
    };
    /**
     * 新疆-克拉玛依
     */
    public static String[] xinjiangKelamayiName = new String[]{
            "市辖区",
            "独山子",
            "克拉玛依",
            "白碱滩",
            "乌尔禾"
    };
    /**
     * 新疆-克拉玛依
     */
    public static int[] xinjiangKelamayiId = new int[]{
            109003416,
            109003417,
            109003418,
            109003419,
            109003420
    };
    /**
     * 新疆-吐鲁番
     */
    public static String[] xinjiangTulufanName = new String[]{
            "吐鲁番",
            "鄯善",
            "托克逊"
    };
    /**
     * 新疆-吐鲁番
     */
    public static int[] xinjiangTulufanId = new int[]{
            109003422,
            109003423,
            109003424
    };
    /**
     * 新疆-哈密
     */
    public static String[] xinjiangHamiName = new String[]{
            "哈密",
            "巴里坤哈萨克",
            "伊吾"
    };
    /**
     * 新疆-哈密
     */
    public static int[] xinjiangHamiId = new int[]{
            109003426,
            109003427,
            109003428
    };
    /**
     * 新疆-昌吉
     */
    public static String[] xinjiangChangjiName = new String[]{
            "昌吉",
            "阜康",
            "米泉",
            "呼图壁",
            "玛纳斯",
            "奇台",
            "吉木萨尔",
            "木垒哈萨克"
    };
    /**
     * 新疆-昌吉
     */
    public static int[] xinjiangChangjiId = new int[]{
            109003430,
            109003431,
            109003432,
            109003433,
            109003434,
            109003435,
            109003436,
            109003437
    };
    /**
     * 新疆-博尔塔拉
     */
    public static String[] xinjiangBoertalaName = new String[]{
            "博乐",
            "精河",
            "温泉"
    };
    /**
     * 新疆-博尔塔拉
     */
    public static int[] xinjiangBoertalaId = new int[]{
            109003439,
            109003440,
            109003441
    };
    /**
     * 新疆-巴音郭楞
     */
    public static String[] xinjiangBayinguolengName = new String[]{
            "库尔勒",
            "轮台",
            "尉犁",
            "若羌",
            "且末",
            "焉耆",
            "和静",
            "和硕",
            "博湖"
    };
    /**
     * 新疆-巴音郭楞
     */
    public static int[] xinjiangBayinguolengId = new int[]{
            109003443,
            109003444,
            109003445,
            109003446,
            109003447,
            109003448,
            109003449,
            109003450,
            109003451
    };
    /**
     * 新疆-阿克苏
     */
    public static String[] xinjiangAkesuName = new String[]{
                    "阿克苏",
                    "温宿",
                    "库车",
                    "沙雅",
                    "新和",
                    "拜城",
                    "乌什",
                    "阿瓦提",
                    "柯坪"
            };
    /**
     * 新疆-阿克苏
     */
    public static int[] xinjiangAkesuId = new int[]{
            109003453,
            109003454,
            109003455,
            109003456,
            109003457,
            109003458,
            109003459,
            109003460,
            109003461
    };
    /**
     * 新疆-克孜勒苏
     */
    public static String[] xinjiangKezilesuName = new String[]{
            "阿图什",
            "阿克陶",
            "阿合奇",
            "乌恰"
    };
    /**
     * 新疆-克孜勒苏
     */
    public static int[] xinjiangKezilesuId = new int[]{
            109003463,
            109003464,
            109003465,
            109003466
    };
    /**
     * 新疆-喀什
     */
    public static String[] xinjiangKashiName = new String[]{
            "喀什",
            "疏附",
            "疏勒",
            "英吉沙",
            "泽普",
            "莎车",
            "叶城",
            "麦盖提",
            "岳普湖",
            "伽师",
            "巴楚",
            "塔什库尔干塔吉克自治"
    };
    /**
     * 新疆-喀什
     */
    public static int[] xinjiangKashiId = new int[]{
            109003468,
            109003469,
            109003470,
            109003471,
            109003472,
            109003473,
            109003474,
            109003475,
            109003476,
            109003477,
            109003478,
            109003479
    };
    /**
     * 新疆-和田
     */
    public static String[] xinjiangHetianName = new String[]{
            "和田",
            "和田",
            "墨玉",
            "皮山",
            "洛浦",
            "策勒",
            "于田",
            "民丰"
    };
    /**
     * 新疆-和田
     */
    public static int[] xinjiangHetianId = new int[]{
            109003481,
            109003482,
            109003483,
            109003484,
            109003485,
            109003486,
            109003487,
            109003488
    };
    /**
     * 新疆-伊犁
     */
    public static String[] xinjiangYiliName = new String[]{
            "伊宁",
            "奎屯",
            "伊宁",
            "察布查尔",
            "霍城",
            "巩留",
            "新源",
            "昭苏",
            "特克斯",
            "尼勒克"
    };
    /**
     * 新疆-伊犁
     */
    public static int[] xinjiangYiliId = new int[]{
            109003490,
            109003491,
            109003492,
            109003493,
            109003494,
            109003495,
            109003496,
            109003497,
            109003498,
            109003499
    };
    /**
     * 新疆-塔城
     */
    public static String[] xinjiangTachengName = new String[]{
            "塔城",
            "乌苏",
            "额敏",
            "沙湾",
            "托里",
            "裕民",
            "和布克赛尔蒙古"
    };
    /**
     * 新疆-塔城
     */
    public static int[] xinjiangTachengId = new int[]{
            109003501,
            109003502,
            109003503,
            109003504,
            109003505,
            109003506,
            109003507
    };
    /**
     * 新疆-阿勒泰
     */
    public static String[] xinjiangAletaiName = new String[]{
            "阿勒泰",
            "布尔津",
            "富蕴",
            "福海",
            "哈巴河",
            "青河",
            "吉木乃"
    };
    /**
     * 新疆-阿勒泰
     */
    public static int[] xinjiangAletaiId = new int[]{
            109003509,
            109003510,
            109003511,
            109003512,
            109003513,
            109003514,
            109003515
    };
    /**
     * 新疆-省直辖
     */
    public static String[] xinjiangShengzhixiangName = new String[]{
            "石河子",
            "阿拉尔",
            "图木舒克",
            "五家渠"
    };
    /**
     * 新疆-省直辖
     */
    public static int[] xinjiangShengzhixiangId = new int[]{
            109003517,
            109003518,
            109003519,
            109003520
    };
    /**
     * 湖北
     */
    public static String[] hubeiName = new String[]{
            "武汉",
            "黄石",
            "十堰",
            "宜昌",
            "襄阳",
            "鄂州",
            "荆门",
            "孝感",
            "荆州",
            "黄冈",
            "咸宁",
            "随州",
            "恩施",
            "省直辖"
    };
    /**
     * 湖北
     */
    public static int[] hubeiId = new int[]{
            109001869,
            109001884,
            109001892,
            109001902,
            109001917,
            109001928,
            109001933,
            109001940,
            109001949,
            109001959,
            109001971,
            109001979,
            109001983,
            109001992
    };
    /**
     * 湖北-武汉
     */
    public static String[] hubeiWuhanName = new String[]{
            "市辖区",
            "江岸",
            "江汉",
            "硚口",
            "汉阳",
            "武昌",
            "青山",
            "洪山",
            "东西湖",
            "汉南",
            "蔡甸",
            "江夏",
            "黄陂",
            "新洲"
    };
    /**
     * 湖北-武汉
     */
    public static int[] hubeiWuhanId = new int[]{
            109001870,
            109001871,
            109001872,
            109001873,
            109001874,
            109001875,
            109001876,
            109001877,
            109001878,
            109001879,
            109001880,
            109001881,
            109001882,
            109001883
    };
    /**
     * 湖北-黄石
     */
    public static String[] hubeiHuangshiName = new String[]{
            "市辖区",
            "黄石港",
            "西塞山",
            "下陆",
            "铁山",
            "阳新",
            "大冶"
    };
    /**
     * 湖北-黄石
     */
    public static int[] hubeiHuangshiId = new int[]{
            109001885,
            109001886,
            109001887,
            109001888,
            109001889,
            109001890,
            109001891
    };
    /**
     * 湖北-十堰
     */
    public static String[] hubeiShiyanName = new String[]{
            "市辖区",
            "茅箭",
            "张湾",
            "郧县",
            "郧西",
            "竹山",
            "竹溪",
            "房县",
            "丹江口"
    };
    /**
     * 湖北-十堰
     */
    public static int[] hubeiShiyanId = new int[]{
            109001893,
            109001894,
            109001895,
            109001896,
            109001897,
            109001898,
            109001899,
            109001900,
            109001901
    };
    /**
     * 湖北-宜昌
     */
    public static String[] hubeiYichangName = new String[]{
            "市辖区",
            "西陵",
            "伍家岗",
            "点军",
            "猇亭",
            "夷陵",
            "远安",
            "兴山",
            "秭归",
            "长阳",
            "五峰",
            "宜都",
            "当阳",
            "枝江"
    };
    /**
     * 湖北-宜昌
     */
    public static int[] hubeiYichangId = new int[]{
            109001903,
            109001904,
            109001905,
            109001906,
            109001907,
            109001908,
            109001909,
            109001910,
            109001911,
            109001912,
            109001913,
            109001914,
            109001915,
            109001916
    };
    /**
     * 湖北-襄阳
     */
    public static String[] hubeiXiangyangName = new String[]{
            "市辖区",
            "襄城",
            "樊城",
            "襄阳",
            "南漳",
            "谷城",
            "保康",
            "老河口",
            "枣阳",
            "宜城"
    };
    /**
     * 湖北-襄阳
     */
    public static int[] hubeiXiangyangId = new int[]{
            109001918,
            109001919,
            109001920,
            109001921,
            109001922,
            109001923,
            109001924,
            109001925,
            109001926,
            109001927
    };
    /**
     * 湖北-鄂州
     */
    public static String[] hubeiEzhouName = new String[]{
            "市辖区",
            "梁子湖",
            "华容",
            "鄂城"
    };
    /**
     * 湖北-鄂州
     */
    public static int[] hubeiEzhouId = new int[]{
            109001929,
            109001930,
            109001931,
            109001932
    };
    /**
     * 湖北-荆门
     */
    public static String[] hubeiJingmenName = new String[]{
            "市辖区",
            "东宝",
            "掇刀",
            "京山",
            "沙洋",
            "钟祥"
    };
    /**
     * 湖北-荆门
     */
    public static int[] hubeiJingmenId = new int[]{
            109001934,
            109001935,
            109001936,
            109001937,
            109001938,
            109001939
    };
    /**
     * 湖北-孝感
     */
    public static String[] hubeiXiaoganName = new String[]{
            "市辖区",
            "孝南",
            "孝昌",
            "大悟",
            "云梦",
            "应城",
            "安陆",
            "汉川"
    };
    /**
     * 湖北-孝感
     */
    public static int[] hubeiXiaoganId = new int[]{
            109001941,
            109001942,
            109001943,
            109001944,
            109001945,
            109001946,
            109001947,
            109001948
    };
    /**
     * 湖北-荆州
     */
    public static String[] hubeiJingzhouName = new String[]{
            "市辖区",
            "沙市",
            "荆州",
            "公安",
            "监利",
            "江陵",
            "石首",
            "洪湖",
            "松滋"
    };
    /**
     * 湖北-荆州
     */
    public static int[] hubeiJingzhouId = new int[]{
            109001950,
            109001951,
            109001952,
            109001953,
            109001954,
            109001955,
            109001956,
            109001957,
            109001958
    };
    /**
     * 湖北-黄冈
     */
    public static String[] hubeiHuanggangName = new String[]{
            "市辖区",
            "黄州",
            "团风",
            "红安",
            "罗田",
            "英山",
            "浠水",
            "蕲春",
            "黄梅",
            "麻城",
            "武穴"
    };
    /**
     * 湖北-黄冈
     */
    public static int[] hubeiHuanggangId = new int[]{
            109001960,
            109001961,
            109001962,
            109001963,
            109001964,
            109001965,
            109001966,
            109001967,
            109001968,
            109001969,
            109001970
    };
    /**
     * 湖北-咸宁
     */
    public static String[] hubeiXianningName = new String[]{
            "市辖区",
            "咸安",
            "嘉鱼",
            "通城",
            "崇阳",
            "通山",
            "赤壁"
    };
    /**
     * 湖北-咸宁
     */
    public static int[] hubeiXianningId = new int[]{
            109001972,
            109001973,
            109001974,
            109001975,
            109001976,
            109001977,
            109001978
    };
    /**
     * 湖北-随州
     */
    public static String[] hubeiSuizhouName = new String[]{
            "市辖区",
            "曾都",
            "广水"
    };
    /**
     * 湖北-随州
     */
    public static int[] hubeiSuizhouId = new int[]{
            109001980,
            109001981,
            109001982
    };
    /**
     * 湖北-恩施
     */
    public static String[] hubeiEnshiName = new String[]{
            "恩施",
            "利川",
            "建始",
            "巴东",
            "宣恩",
            "咸丰",
            "来凤",
            "鹤峰"
    };
    /**
     * 湖北-恩施
     */
    public static int[] hubeiEnshiId = new int[]{
            109001984,
            109001985,
            109001986,
            109001987,
            109001988,
            109001989,
            109001990,
            109001991
    };
    /**
     * 湖北-省直辖
     */
    public static String[] hubeiShengzhixiaName = new String[]{
            "仙桃",
            "潜江",
            "天门",
            "神农架林"
    };
    /**
     * 湖北-省直辖
     */
    public static int[] hubeiShengzhixiaId = new int[]{
            109001993,
            109001994,
            109001995,
            109001996
    };
    /**
     * 湖南
     */
    public static String[] hunanName = new String[]{
            "长沙",
            "株洲",
            "湘潭",
            "衡阳",
            "邵阳",
            "岳阳",
            "常德",
            "张家界",
            "益阳",
            "郴州",
            "永州",
            "怀化",
            "娄底",
            "湘西"
    };
    /**
     * 湖南
     */
    public static int[] hunanId = new int[]{
            109001998,
            109002009,
            109002020,
            109002027,
            109002041,
            109002055,
            109002066,
            109002077,
            109002083,
            109002091,
            109002104,
            109002117,
            109002131,
            109002138
    };
    /**
     * 湖南-长沙
     */
    public static String[] hunanChangshaName = new String[]{
            "市辖区",
            "芙蓉",
            "天心",
            "岳麓",
            "开福",
            "雨花",
            "长沙",
            "望城",
            "宁乡",
            "浏阳"
    };
    /**
     * 湖南-长沙
     */
    public static int[] hunanChangshaId = new int[]{
            109001999,
            109002000,
            109002001,
            109002002,
            109002003,
            109002004,
            109002005,
            109002006,
            109002007,
            109002008
    };
    /**
     * 湖南-株洲
     */
    public static String[] hunanZhuzhouName = new String[]{
            "市辖区",
            "荷塘",
            "芦淞",
            "石峰",
            "天元",
            "株洲",
            "攸县",
            "茶陵",
            "炎陵",
            "醴陵"
    };
    /**
     * 湖南-株洲
     */
    public static int[] hunanZhuzhouId = new int[]{
            109002010,
            109002011,
            109002012,
            109002013,
            109002014,
            109002015,
            109002016,
            109002017,
            109002018,
            109002019
    };
    /**
     * 湖南-湘潭
     */
    public static String[] hunanXiangtanName = new String[]{
            "市辖区",
            "雨湖",
            "岳塘",
            "湘潭",
            "湘乡",
            "韶山"
    };
    /**
     * 湖南-湘潭
     */
    public static int[] hunanXiangtanId = new int[]{
            109002021,
            109002022,
            109002023,
            109002024,
            109002025,
            109002026
    };
    /**
     * 湖南-衡阳
     */
    public static String[] hunanHengyangName = new String[]{
            "市辖区",
            "珠晖",
            "雁峰",
            "石鼓",
            "蒸湘",
            "南岳",
            "衡阳",
            "衡南",
            "衡山",
            "衡东",
            "祁东",
            "耒阳",
            "常宁"
    };
    /**
     * 湖南-衡阳
     */
    public static int[] hunanHengyangId = new int[]{
            109002028,
            109002029,
            109002030,
            109002031,
            109002032,
            109002033,
            109002034,
            109002035,
            109002036,
            109002037,
            109002038,
            109002039,
            109002040
    };
    /**
     * 湖南-邵阳
     */
    public static String[] hunanShaoyangName = new String[]{
            "市辖区",
            "双清",
            "大祥",
            "北塔",
            "邵东",
            "新邵",
            "邵阳",
            "隆回",
            "洞口",
            "绥宁",
            "新宁",
            "城步",
            "武冈"
    };
    /**
     * 湖南-邵阳
     */
    public static int[] hunanShaoyangId = new int[]{
            109002042,
            109002043,
            109002044,
            109002045,
            109002046,
            109002047,
            109002048,
            109002049,
            109002050,
            109002051,
            109002052,
            109002053,
            109002054
    };
    /**
     * 湖南-岳阳
     */
    public static String[] hunanYueyangName = new String[]{
            "市辖区",
            "岳阳楼",
            "云溪",
            "君山",
            "岳阳",
            "华容",
            "湘阴",
            "平江",
            "汨罗",
            "临湘"
    };
    /**
     * 湖南-岳阳
     */
    public static int[] hunanYueyangId = new int[]{
            109002056,
            109002057,
            109002058,
            109002059,
            109002060,
            109002061,
            109002062,
            109002063,
            109002064,
            109002065
    };
    /**
     * 湖南-常德
     */
    public static String[] hunanChangdeName = new String[]{
            "市辖区",
            "武陵",
            "鼎城",
            "安乡",
            "汉寿",
            "澧县",
            "临澧",
            "桃源",
            "石门",
            "津市"
    };
    /**
     * 湖南-常德
     */
    public static int[] hunanChangdeId = new int[]{
            109002067,
            109002068,
            109002069,
            109002070,
            109002071,
            109002072,
            109002073,
            109002074,
            109002075,
            109002076
    };
    /**
     * 湖南-张家界
     */
    public static String[] hunanZhangjiajieName = new String[]{
            "市辖区",
            "永定",
            "武陵源",
            "慈利",
            "桑植"
    };
    /**
     * 湖南-张家界
     */
    public static int[] hunanZhangjiajieId = new int[]{
            109002078,
            109002079,
            109002080,
            109002081,
            109002082
    };
    /**
     * 湖南-益阳
     */
    public static String[] hunanYiyangName = new String[]{
            "市辖区",
            "资阳",
            "赫山",
            "南县",
            "桃江",
            "安化",
            "沅江"
    };
    /**
     * 湖南-益阳
     */
    public static int[] hunanYiyangId = new int[]{
            109002084,
            109002085,
            109002086,
            109002087,
            109002088,
            109002089,
            109002090
    };
    /**
     * 湖南-郴州
     */
    public static String[] hunanBinzhouName = new String[]{
            "市辖区",
            "北湖",
            "苏仙",
            "桂阳",
            "宜章",
            "永兴",
            "嘉禾",
            "临武",
            "汝城",
            "桂东",
            "安仁",
            "资兴"
    };
    /**
     * 湖南-郴州
     */
    public static int[] hunanBinzhouId = new int[]{
            109002092,
            109002093,
            109002094,
            109002095,
            109002096,
            109002097,
            109002098,
            109002099,
            109002100,
            109002101,
            109002102,
            109002103
    };
    /**
     * 湖南-永州
     */
    public static String[] hunanYongzhouName = new String[]{
            "市辖区",
            "芝山",
            "冷水滩",
            "祁阳",
            "东安",
            "双牌",
            "道县",
            "江永",
            "宁远",
            "蓝山",
            "新田",
            "江华"
    };
    /**
     * 湖南-永州
     */
    public static int[] hunanYongzhouId = new int[]{
            109002105,
            109002106,
            109002107,
            109002108,
            109002109,
            109002110,
            109002111,
            109002112,
            109002113,
            109002114,
            109002115,
            109002116
    };
    /**
     * 湖南-怀化
     */
    public static String[] hunanHuaihuaName = new String[]{
            "市辖区",
            "鹤城",
            "中方",
            "沅陵",
            "辰溪",
            "溆浦",
            "会同",
            "麻阳",
            "新晃",
            "芷江",
            "靖州",
            "通道",
            "洪江"
    };
    /**
     * 湖南-怀化
     */
    public static int[] hunanHuaihuaId = new int[]{
            109002118,
            109002119,
            109002120,
            109002121,
            109002122,
            109002123,
            109002124,
            109002125,
            109002126,
            109002127,
            109002128,
            109002129,
            109002130
    };
    /**
     * 湖南-娄底
     */
    public static String[] hunanLoudiName = new String[]{
            "市辖区",
            "娄星",
            "双峰",
            "新化",
            "冷水江",
            "涟源"
    };
    /**
     * 湖南-娄底
     */
    public static int[] hunanLoudiId = new int[]{
            109002132,
            109002133,
            109002134,
            109002135,
            109002136,
            109002137
    };
    /**
     * 湖南-湘西
     */
    public static String[] hunanXiangxiName = new String[]{
            "吉首",
            "泸溪",
            "凤凰",
            "花垣",
            "保靖",
            "古丈",
            "永顺",
            "龙山"
    };
    /**
     * 湖南-湘西
     */
    public static int[] hunanXiangxiId = new int[]{
            109002139,
            109002140,
            109002141,
            109002142,
            109002143,
            109002144,
            109002145,
            109002146
    };
    /**
     * 江苏
     */
    public static String[] jiangsuName = new String[]{
            "南京",
            "无锡",
            "徐州",
            "常州",
            "苏州",
            "南通",
            "连云港",
            "淮安",
            "盐城",
            "扬州",
            "镇江",
            "泰州",
            "宿迁"
    };
    /**
     * 江苏
     */
    public static int[] jiangsuId = new int[]{
            109000888,
            109000903,
            109000913,
            109000926,
            109000935,
            109000948,
            109000958,
            109000967,
            109000977,
            109000988,
            109000997,
            109001005,
            109001013
    };
    /**
     * 江苏-南京
     */
    public static String[] jiangsuNanjingName = new String[]{
            "市辖区",
            "玄武",
            "白下",
            "秦淮",
            "建邺",
            "鼓楼",
            "下关",
            "浦口",
            "栖霞",
            "雨花台",
            "江宁",
            "六合",
            "溧水",
            "高淳"
    };
    /**
     * 江苏-南京
     */
    public static int[] jiangsuNanjingId = new int[]{
            109000889,
            109000890,
            109000891,
            109000892,
            109000893,
            109000894,
            109000895,
            109000896,
            109000897,
            109000898,
            109000899,
            109000900,
            109000901,
            109000902
    };
    /**
     * 江苏-无锡
     */
    public static String[] jiangsuWuxiName = new String[]{
            "市辖区",
            "崇安",
            "南长",
            "北塘",
            "锡山",
            "惠山",
            "滨湖",
            "江阴",
            "宜兴"
    };
    /**
     * 江苏-无锡
     */
    public static int[] jiangsuWuxiId = new int[]{
            109000904,
            109000905,
            109000906,
            109000907,
            109000908,
            109000909,
            109000910,
            109000911,
            109000912
    };
    /**
     * 江苏-徐州
     */
    public static String[] jiangsuXuzhouName = new String[]{
            "市辖区",
            "鼓楼",
            "云龙",
            "九里",
            "贾汪",
            "泉山",
            "丰县",
            "沛县",
            "铜山",
            "睢宁",
            "新沂",
            "邳州"
    };
    /**
     * 江苏-徐州
     */
    public static int[] jiangsuXuzhouId = new int[]{
            109000914,
            109000915,
            109000916,
            109000917,
            109000918,
            109000919,
            109000920,
            109000921,
            109000922,
            109000923,
            109000924,
            109000925
    };
    /**
     * 江苏-常州
     */
    public static String[] jiangsuChangzhouName = new String[]{
            "市辖区",
            "天宁",
            "钟楼",
            "戚墅堰",
            "新北",
            "武进",
            "溧阳",
            "金坛"
    };
    /**
     * 江苏-常州
     */
    public static int[] jiangsuChangzhouId = new int[]{
            109000927,
            109000928,
            109000929,
            109000930,
            109000931,
            109000932,
            109000933,
            109000934
    };
    /**
     * 江苏-苏州
     */
    public static String[] jiangsuSuzhouName = new String[]{
            "市辖区",
            "沧浪",
            "平江",
            "金阊",
            "虎丘",
            "吴中",
            "相城",
            "常熟",
            "张家港",
            "昆山",
            "吴江",
            "太仓"
    };
    /**
     * 江苏-苏州
     */
    public static int[] jiangsuSuzhouId = new int[]{
            109000936,
            109000937,
            109000938,
            109000939,
            109000940,
            109000941,
            109000942,
            109000943,
            109000944,
            109000945,
            109000946,
            109000947
    };
    /**
     * 江苏-南通
     */
    public static String[] jiangsuNantongName = new String[]{
            "市辖区",
            "崇川",
            "港闸",
            "海安",
            "如东",
            "启东",
            "如皋",
            "通州",
            "海门"
    };
    /**
     * 江苏-南通
     */
    public static int[] jiangsuNantongId = new int[]{
            109000949,
            109000950,
            109000951,
            109000952,
            109000953,
            109000954,
            109000955,
            109000956,
            109000957
    };
    /**
     * 江苏-连云港
     */
    public static String[] jiangsuLianyungangName = new String[]{
            "市辖区",
            "连云",
            "新浦",
            "海州",
            "赣榆",
            "东海",
            "灌云",
            "灌南"
    };
    /**
     * 江苏-连云港
     */
    public static int[] jiangsuLianyungangId = new int[]{
            109000959,
            109000960,
            109000961,
            109000962,
            109000963,
            109000964,
            109000965,
            109000966
    };
    /**
     * 江苏-淮安
     */
    public static String[] jiangsuHuaianName = new String[]{
            "市辖区",
            "清河",
            "楚州",
            "淮阴",
            "清浦",
            "涟水",
            "洪泽",
            "盱眙",
            "金湖"
    };
    /**
     * 江苏-淮安
     */
    public static int[] jiangsuHuaianId = new int[]{
            109000968,
            109000969,
            109000970,
            109000971,
            109000972,
            109000973,
            109000974,
            109000975,
            109000976
    };
    /**
     * 江苏-盐城
     */
    public static String[] jiangsuYanchengName = new String[]{
            "市辖区",
            "亭湖",
            "盐都",
            "响水",
            "滨海",
            "阜宁",
            "射阳",
            "建湖",
            "东台",
            "大丰"
    };
    /**
     * 江苏-盐城
     */
    public static int[] jiangsuYanchengId = new int[]{
            109000978,
            109000979,
            109000980,
            109000981,
            109000982,
            109000983,
            109000984,
            109000985,
            109000986,
            109000987
    };
    /**
     * 江苏-扬州
     */
    public static String[] jiangsuYangzhouName = new String[]{
            "市辖区",
            "广陵",
            "邗江",
            "维扬",
            "宝应",
            "仪征",
            "高邮",
            "江都"
    };
    /**
     * 江苏-扬州
     */
    public static int[] jiangsuYangzhouId = new int[]{
            109000989,
            109000990,
            109000991,
            109000992,
            109000993,
            109000994,
            109000995,
            109000996
    };
    /**
     * 江苏-镇江
     */
    public static String[] jiangsuZhenjiangName = new String[]{
            "市辖区",
            "京口",
            "润州",
            "丹徒",
            "丹阳",
            "扬中",
            "句容"
    };
    /**
     * 江苏-镇江
     */
    public static int[] jiangsuZhenjiangId = new int[]{
            109000998,
            109000999,
            109001000,
            109001001,
            109001002,
            109001003,
            109001004
    };
    /**
     * 江苏-泰州
     */
    public static String[] jiangsuTaizhouName = new String[]{
            "市辖区",
            "海陵",
            "高港",
            "兴化",
            "靖江",
            "泰兴",
            "姜堰"
    };
    /**
     * 江苏-泰州
     */
    public static int[] jiangsuTaizhouId = new int[]{
            109001006,
            109001007,
            109001008,
            109001009,
            109001010,
            109001011,
            109001012
    };
    /**
     * 江苏-宿迁
     */
    public static String[] jiangsuSuqianName = new String[]{
            "市辖区",
            "宿城",
            "宿豫",
            "沭阳",
            "泗阳",
            "泗洪"
    };
    /**
     * 江苏-宿迁
     */
    public static int[] jiangsuSuqianId = new int[]{
            109001014,
            109001015,
            109001016,
            109001017,
            109001018,
            109001019
    };
    /**
     * 宁夏
     */
    public static String[] ningxiaName = new String[]{
            "银川",
            "石嘴山",
            "吴忠",
            "固原",
            "中卫"
    };
    /**
     * 宁夏
     */
    public static int[] ningxiaId = new int[]{
            109003373,
            109003381,
            109003386,
            109003392,
            109003399
    };
    /**
     * 宁夏-银川
     */
    public static String[] ningxiaYinchuanName = new String[]{
            "市辖区",
            "兴庆",
            "西夏",
            "金凤",
            "永宁",
            "贺兰",
            "灵武"
    };
    /**
     * 宁夏-银川
     */
    public static int[] ningxiaYinchuanId = new int[]{
            109003374,
            109003375,
            109003376,
            109003377,
            109003378,
            109003379,
            109003380
    };
    /**
     * 宁夏-石嘴山
     */
    public static String[] ningxiaShizuishanName = new String[]{
            "市辖区",
            "大武口",
            "惠农",
            "平罗"
    };
    /**
     * 宁夏-石嘴山
     */
    public static int[] ningxiaShizuishanId = new int[]{
            109003382,
            109003383,
            109003384,
            109003385
    };
    /**
     * 宁夏-吴忠
     */
    public static String[] ningxiaWuzhongName = new String[]{
            "市辖区",
            "利通",
            "盐池",
            "同心",
            "青铜峡"
    };
    /**
     * 宁夏-吴忠
     */
    public static int[] ningxiaWuzhongId = new int[]{
            109003387,
            109003388,
            109003389,
            109003390,
            109003391
    };
    /**
     * 宁夏-固原
     */
    public static String[] ningxiaGuyuanName = new String[]{
            "市辖区",
            "原州",
            "西吉",
            "隆德",
            "泾源",
            "彭阳"
    };
    /**
     * 宁夏-固原
     */
    public static int[] ningxiaGuyuanId = new int[]{
            109003393,
            109003394,
            109003395,
            109003396,
            109003397,
            109003398
    };
    /**
     * 宁夏-中卫
     */
    public static String[] ningxiaZhongweiName = new String[]{
            "市辖区",
            "沙坡头",
            "中宁",
            "海原"
    };
    /**
     * 宁夏-中卫
     */
    public static int[] ningxiaZhongweiId = new int[]{
            109003400,
            109003401,
            109003402,
            109003403
    };
    /**
     * 四川
     */
    public static String[] sichuanName = new String[]{
            "成都",
            "自贡",
            "攀枝花",
            "泸州",
            "德阳",
            "绵阳",
            "广元",
            "遂宁",
            "内江",
            "乐山",
            "南充",
            "眉山",
            "宜宾",
            "广安",
            "达州",
            "雅安",
            "巴中",
            "资阳",
            "阿坝",
            "甘孜",
            "凉山"
    };
    /**
     * 四川
     */
    public static int[] sichuanId = new int[]{
            109002521,
            109002542,
            109002550,
            109002557,
            109002566,
            109002574,
            109002585,
            109002594,
            109002601,
            109002608,
            109002621,
            109002632,
            109002640,
            109002652,
            109002659,
            109002668,
            109002678,
            109002684,
            109002690,
            109002704,
            109002723
    };
    /**
     * 四川-成都
     */
    public static String[] sichuanChengduName = new String[]{
            "市辖区",
            "锦江",
            "青羊",
            "金牛",
            "武侯",
            "成华",
            "龙泉驿",
            "青白江",
            "新都",
            "温江",
            "金堂",
            "双流",
            "郫县",
            "大邑",
            "蒲江",
            "新津",
            "都江堰",
            "彭州",
            "邛崃",
            "崇州"
    };
    /**
     * 四川-成都
     */
    public static int[] sichuanChengduId = new int[]{
            109002522,
            109002523,
            109002524,
            109002525,
            109002526,
            109002527,
            109002528,
            109002529,
            109002530,
            109002531,
            109002532,
            109002533,
            109002534,
            109002535,
            109002536,
            109002537,
            109002538,
            109002539,
            109002540,
            109002541
    };
    /**
     * 四川-自贡
     */
    public static String[] sichuanZigongName = new String[]{
            "市辖区",
            "自流井",
            "贡井",
            "大安",
            "沿滩",
            "荣县",
            "富顺"
    };
    /**
     * 四川-自贡
     */
    public static int[] sichuanZigongId = new int[]{
            109002543,
            109002544,
            109002545,
            109002546,
            109002547,
            109002548,
            109002549
    };
    /**
     * 四川-攀枝花
     */
    public static String[] sichuanPanzhihuaName = new String[]{
            "市辖区",
            "东区",
            "西区",
            "仁和",
            "米易",
            "盐边"
    };
    /**
     * 四川-攀枝花
     */
    public static int[] sichuanPanzhihuaId = new int[]{
            109002551,
            109002552,
            109002553,
            109002554,
            109002555,
            109002556
    };
    /**
     * 四川-泸州
     */
    public static String[] sichuanLuzhouName = new String[]{
            "市辖区",
            "江阳",
            "纳溪",
            "龙马潭",
            "泸县",
            "合江",
            "叙永",
            "古蔺"
    };
    /**
     * 四川-泸州
     */
    public static int[] sichuanLuzhouId = new int[]{
            109002558,
            109002559,
            109002560,
            109002561,
            109002562,
            109002563,
            109002564,
            109002565
    };
    /**
     * 四川-德阳
     */
    public static String[] sichuanDeyangName = new String[]{
            "市辖区",
            "旌阳",
            "中江",
            "罗江",
            "广汉",
            "什邡",
            "绵竹"
    };
    /**
     * 四川-德阳
     */
    public static int[] sichuanDeyangId = new int[]{
            109002567,
            109002568,
            109002569,
            109002570,
            109002571,
            109002572,
            109002573
    };
    /**
     * 四川-绵阳
     */
    public static String[] sichuanMianyangName = new String[]{
            "市辖区",
            "涪城",
            "游仙",
            "三台",
            "盐亭",
            "安县",
            "梓潼",
            "北川",
            "平武",
            "江油"
    };
    /**
     * 四川-绵阳
     */
    public static int[] sichuanMianyangId = new int[]{
            109002575,
            109002576,
            109002577,
            109002578,
            109002579,
            109002580,
            109002581,
            109002582,
            109002583,
            109002584
    };
    /**
     * 四川- 广元
     */
    public static String[] sichuanGuangyuanName = new String[]{
            "市辖区",
            "市中",
            "元坝",
            "朝天",
            "旺苍",
            "青川",
            "剑阁",
            "苍溪"
    };
    /**
     * 四川- 广元
     */
    public static int[] sichuanGuangyuanId = new int[]{
            109002586,
            109002587,
            109002588,
            109002589,
            109002590,
            109002591,
            109002592,
            109002593
    };
    /**
     * 四川- 遂宁
     */
    public static String[] sichuanSuiningName = new String[]{
            "市辖区",
            "船山",
            "安居",
            "蓬溪",
            "射洪",
            "大英"
    };
    /**
     * 四川- 遂宁
     */
    public static int[] sichuanSuiningId = new int[]{
            109002595,
            109002596,
            109002597,
            109002598,
            109002599,
            109002600
    };
    /**
     * 四川- 内江
     */
    public static String[] sichuanNeijiangName = new String[]{
            "市辖区",
            "市中",
            "东兴",
            "威远",
            "资中",
            "隆昌"
    };
    /**
     * 四川- 内江
     */
    public static int[] sichuanNeijiangId = new int[]{
            109002602,
            109002603,
            109002604,
            109002605,
            109002606,
            109002607
    };
    /**
     * 四川- 乐山
     */
    public static String[] sichuanLeshanName = new String[]{
            "市辖区",
            "市中",
            "沙湾",
            "五通桥",
            "金口河",
            "犍为",
            "井研",
            "夹江",
            "沐川",
            "峨边",
            "马边",
            "峨眉山"
    };
    /**
     * 四川- 乐山
     */
    public static int[] sichuanLeshanId = new int[]{
            109002609,
            109002610,
            109002611,
            109002612,
            109002613,
            109002614,
            109002615,
            109002616,
            109002617,
            109002618,
            109002619,
            109002620
    };
    /**
     * 四川- 南充
     */
    public static String[] sichuanNanchongName = new String[]{
            "市辖区",
            "顺庆",
            "高坪",
            "嘉陵",
            "南部",
            "营山",
            "蓬安",
            "仪陇",
            "西充",
            "阆中"
    };
    /**
     * 四川- 南充
     */
    public static int[] sichuanNanchongId = new int[]{
            109002622,
            109002623,
            109002624,
            109002625,
            109002626,
            109002627,
            109002628,
            109002629,
            109002630,
            109002631
    };
    /**
     * 四川- 眉山
     */
    public static String[] sichuanMeishanName = new String[]{
            "市辖区",
            "东坡",
            "仁寿",
            "彭山",
            "洪雅",
            "丹棱",
            "青神"
    };
    /**
     * 四川- 眉山
     */
    public static int[] sichuanMeishanId = new int[]{
            109002633,
            109002634,
            109002635,
            109002636,
            109002637,
            109002638,
            109002639
    };
    /**
     * 四川- 宜宾
     */
    public static String[] sichuanYibinName = new String[]{
            "市辖区",
            "翠屏",
            "宜宾",
            "南溪",
            "江安",
            "长宁",
            "高县",
            "珙县",
            "筠连",
            "兴文",
            "屏山"
    };
    /**
     * 四川- 宜宾
     */
    public static int[] sichuanYibinId = new int[]{
            109002641,
            109002642,
            109002643,
            109002644,
            109002645,
            109002646,
            109002647,
            109002648,
            109002649,
            109002650,
            109002651
    };
    /**
     * 四川- 广安
     */
    public static String[] sichuanGuanganName = new String[]{
            "市辖区",
            "广安",
            "岳池",
            "武胜",
            "邻水",
            "华蓥"
    };
    /**
     * 四川- 广安
     */
    public static int[] sichuanGuanganId = new int[]{
            109002653,
            109002654,
            109002655,
            109002656,
            109002657,
            109002658
    };
    /**
     * 四川- 达州
     */
    public static String[] sichuanDazhouName = new String[]{
            "市辖区",
            "通川",
            "达县",
            "宣汉",
            "开江",
            "大竹",
            "渠县",
            "万源"
    };
    /**
     * 四川- 达州
     */
    public static int[] sichuanDazhouId = new int[]{
            109002660,
            109002661,
            109002662,
            109002663,
            109002664,
            109002665,
            109002666,
            109002667
    };
    /**
     * 四川-  雅安
     */
    public static String[] sichuanYaanName = new String[]{
            "市辖区",
            "雨城",
            "名山",
            "荥经",
            "汉源",
            "石棉",
            "天全",
            "芦山",
            "宝兴"
    };
    /**
     * 四川-  雅安
     */
    public static int[] sichuanYaanId = new int[]{
            109002669,
            109002670,
            109002671,
            109002672,
            109002673,
            109002674,
            109002675,
            109002676,
            109002677
    };
    /**
     * 四川-  巴中
     */
    public static String[] sichuanBazhongName = new String[]{
            "市辖区",
            "巴州",
            "通江",
            "南江",
            "平昌"
    };
    /**
     * 四川-  巴中
     */
    public static int[] sichuanBazhongId = new int[]{
            109002679,
            109002680,
            109002681,
            109002682,
            109002683
    };
    /**
     * 四川-  资阳
     */
    public static String[] sichuanZiyangName = new String[]{
            "市辖区",
            "雁江",
            "安岳",
            "乐至",
            "简阳"
    };
    /**
     * 四川-  资阳
     */
    public static int[] sichuanZiyangId = new int[]{
            109002685,
            109002686,
            109002687,
            109002688,
            109002689
    };
    /**
     * 四川-  阿坝
     */
    public static String[] sichuanAbeiName = new String[]{
            "汶川",
            "理县",
            "茂县",
            "松潘",
            "九寨沟",
            "金川",
            "小金",
            "黑水",
            "马尔康",
            "壤塘",
            "阿坝",
            "若尔盖",
            "红原"
    };
    /**
     * 四川-  阿坝
     */
    public static int[] sichuanAbeiId = new int[]{
            109002691,
            109002692,
            109002693,
            109002694,
            109002695,
            109002696,
            109002697,
            109002698,
            109002699,
            109002700,
            109002701,
            109002702,
            109002703
    };
    /**
     * 四川-  甘孜
     */
    public static String[] sichuanGanziName = new String[]{
            "康定",
            "泸定",
            "丹巴",
            "九龙",
            "雅江",
            "道孚",
            "炉霍",
            "甘孜",
            "新龙",
            "德格",
            "白玉",
            "石渠",
            "色达",
            "理塘",
            "巴塘",
            "乡城",
            "稻城",
            "得荣"
    };
    /**
     * 四川-  甘孜
     */
    public static int[] sichuanGanziId = new int[]{
            109002705,
            109002706,
            109002707,
            109002708,
            109002709,
            109002710,
            109002711,
            109002712,
            109002713,
            109002714,
            109002715,
            109002716,
            109002717,
            109002718,
            109002719,
            109002720,
            109002721,
            109002722
    };
    /**
     * 四川-  凉山
     */
    public static String[] sichuanLiangshanName = new String[]{
            "西昌",
            "木里",
            "盐源",
            "德昌",
            "会理",
            "会东",
            "宁南",
            "普格",
            "布拖",
            "金阳",
            "昭觉",
            "喜德",
            "冕宁",
            "越西",
            "甘洛",
            "美姑",
            "雷波"
    };
    /**
     * 四川-  凉山
     */
    public static int[] sichuanLiangshanId = new int[]{
            109002724,
            109002725,
            109002726,
            109002727,
            109002728,
            109002729,
            109002730,
            109002731,
            109002732,
            109002733,
            109002734,
            109002735,
            109002736,
            109002737,
            109002738,
            109002739,
            109002740
    };
    /**
     * 安徽
     */
    public static String[] anhuiName = new String[]{
            "合肥",
            "芜湖",
            "蚌埠",
            "淮南",
            "马鞍山",
            "淮北",
            "铜陵",
            "安庆",
            "黄山",
            "滁州",
            "阜阳",
            "宿州",
            "巢湖",
            "六安",
            "亳州",
            "池州",
            "宣城"
    };
    /**
     * 安徽
     */
    public static int[] anhuiId = new int[]{
            109001134,
            109001143,
            109001152,
            109001161,
            109001169,
            109001175,
            109001181,
            109001187,
            109001200,
            109001209,
            109001219,
            109001229,
            109001236,
            109001243,
            109001252,
            109001258,
            109001264
    };
    /**
     * 安徽-合肥
     */
    public static String[] anhuiHefenName = new String[]{
            "市辖区",
            "瑶海",
            "庐阳",
            "蜀山",
            "包河",
            "长丰",
            "肥东",
            "肥西"
    };
    /**
     * 安徽-合肥
     */
    public static int[] anhuiHefenId = new int[]{
            109001135,
            109001136,
            109001137,
            109001138,
            109001139,
            109001140,
            109001141,
            109001142
    };
    /**
     * 安徽-芜湖
     */
    public static String[] anhuiWuhuName = new String[]{
            "市辖区",
            "镜湖",
            "马塘",
            "新芜",
            "鸠江",
            "芜湖",
            "繁昌",
            "南陵"
    };
    /**
     * 安徽-芜湖
     */
    public static int[] anhuiWuhuId = new int[]{
            109001144,
            109001145,
            109001146,
            109001147,
            109001148,
            109001149,
            109001150,
            109001151
    };
    /**
     * 安徽-蚌埠
     */
    public static String[] anhuiBangbuName = new String[]{
            "市辖区",
            "龙子湖",
            "蚌山",
            "禹会",
            "淮上",
            "怀远",
            "五河",
            "固镇"
    };
    /**
     * 安徽-蚌埠
     */
    public static int[] anhuiBangbuId = new int[]{
            109001153,
            109001154,
            109001155,
            109001156,
            109001157,
            109001158,
            109001159,
            109001160
    };
    /**
     * 安徽-淮南
     */
    public static String[] anhuiHuainanName = new String[]{
            "市辖区",
            "大通",
            "田家庵",
            "谢家集",
            "八公山",
            "潘集",
            "凤台"
    };
    /**
     * 安徽-淮南
     */
    public static int[] anhuiHuainanId = new int[]{
            109001162,
            109001163,
            109001164,
            109001165,
            109001166,
            109001167,
            109001168
    };
    /**
     * 安徽-马鞍山
     */
    public static String[] anhuiMaanshanName = new String[]{
            "市辖区",
            "金家庄",
            "花山",
            "雨山",
            "当涂"
    };
    /**
     * 安徽-马鞍山
     */
    public static int[] anhuiMaanshanId = new int[]{
            109001170,
            109001171,
            109001172,
            109001173,
            109001174
    };
    /**
     * 安徽-淮北
     */
    public static String[] anhuiHuaibeiName = new String[]{
            "市辖区",
            "杜集",
            "相山",
            "烈山",
            "濉溪"
    };
    /**
     * 安徽-淮北
     */
    public static int[] anhuiHuaibeiId = new int[]{
            109001176,
            109001177,
            109001178,
            109001179,
            109001180
    };
    /**
     * 安徽-铜陵
     */
    public static String[] anhuiTonglingName = new String[]{
            "市辖区",
            "铜官山",
            "狮子山",
            "郊区",
            "铜陵"
    };
    /**
     * 安徽-铜陵
     */
    public static int[] anhuiTonglingId = new int[]{
            109001182,
            109001183,
            109001184,
            109001185,
            109001186
    };
    /**
     * 安徽-安庆
     */
    public static String[] anhuiAnqingName = new String[]{
            "市辖区",
            "迎江",
            "大观",
            "郊区",
            "怀宁",
            "枞阳",
            "潜山",
            "太湖",
            "宿松",
            "望江",
            "岳西",
            "桐城"
    };
    /**
     * 安徽-安庆
     */
    public static int[] anhuiAnqingId = new int[]{
            109001188,
            109001189,
            109001190,
            109001191,
            109001192,
            109001193,
            109001194,
            109001195,
            109001196,
            109001197,
            109001198,
            109001199
    };
    /**
     * 安徽-黄山
     */
    public static String[] anhuiHuanshanName = new String[]{
            "市辖区",
            "屯溪",
            "黄山",
            "徽州",
            "歙县",
            "休宁",
            "黟县",
            "祁门"
    };
    /**
     * 安徽-黄山
     */
    public static int[] anhuiHuanshanId = new int[]{
            109001201,
            109001202,
            109001203,
            109001204,
            109001205,
            109001206,
            109001207,
            109001208
    };
    /**
     * 安徽- 滁州
     */
    public static String[] anhuiChuzhouName = new String[]{
            "市辖区",
            "琅琊",
            "南谯",
            "来安",
            "全椒",
            "定远",
            "凤阳",
            "天长",
            "明光"
    };
    /**
     * 安徽- 滁州
     */
    public static int[] anhuiChuzhouId = new int[]{
            109001210,
            109001211,
            109001212,
            109001213,
            109001214,
            109001215,
            109001216,
            109001217,
            109001218
    };
    /**
     * 安徽- 阜阳
     */
    public static String[] anhuiBuyangName = new String[]{
            "市辖区",
            "颍州",
            "颍东",
            "颍泉",
            "临泉",
            "太和",
            "阜南",
            "颍上",
            "界首"
    };
    /**
     * 安徽- 阜阳
     */
    public static int[] anhuiBuyangId = new int[]{
            109001220,
            109001221,
            109001222,
            109001223,
            109001224,
            109001225,
            109001226,
            109001227,
            109001228
    };
    /**
     * 安徽- 宿州
     */
    public static String[] anhuiSuzhouName = new String[]{
            "市辖区",
            "埇桥",
            "砀山",
            "萧县",
            "灵璧",
            "泗县"
    };
    /**
     * 安徽- 宿州
     */
    public static int[] anhuiSuzhouId = new int[]{
            109001230,
            109001231,
            109001232,
            109001233,
            109001234,
            109001235
    };
    /**
     * 安徽-  巢湖
     */
    public static String[] anhuiChaohuName = new String[]{
            "市辖区",
            "居巢",
            "庐江",
            "无为",
            "含山",
            "和县"
    };
    /**
     * 安徽-  巢湖
     */
    public static int[] anhuiChaohuId = new int[]{
            109001237,
            109001238,
            109001239,
            109001240,
            109001241,
            109001242
    };
    /**
     * 安徽-  六安
     */
    public static String[] anhuiLiuanName = new String[]{
            "市辖区",
            "金安",
            "裕安",
            "寿县",
            "霍邱",
            "舒城",
            "金寨",
            "霍山"
    };
    /**
     * 安徽-  六安
     */
    public static int[] anhuiLiuanId = new int[]{
            109001244,
            109001245,
            109001246,
            109001247,
            109001248,
            109001249,
            109001250,
            109001251
    };
    /**
     * 安徽-  亳州
     */
    public static String[] anhuiHaozhouName = new String[]{
            "市辖区",
            "谯城",
            "涡阳",
            "蒙城",
            "利辛"
    };
    /**
     * 安徽-  亳州
     */
    public static int[] anhuiHaozhouId = new int[]{
            109001253,
            109001254,
            109001255,
            109001256,
            109001257
    };
    /**
     * 安徽- 池州
     */
    public static String[] anhuiChizhouName = new String[]{
            "市辖区",
            "贵池",
            "东至",
            "石台",
            "青阳"
    };
    /**
     * 安徽- 池州
     */
    public static int[] anhuiChizhouId = new int[]{
            109001259,
            109001260,
            109001261,
            109001262,
            109001263
    };
    /**
     * 安徽-宣城
     */
    public static String[] anhuiXuanchengName = new String[]{
            "市辖区",
            "宣州",
            "郎溪",
            "广德",
            "泾县",
            "绩溪",
            "旌德",
            "宁国"
    };
    /**
     * 安徽- 宣城
     */
    public static int[] anhuiXuanchengId = new int[]{
            109001265,
            109001266,
            109001267,
            109001268,
            109001269,
            109001270,
            109001271,
            109001272
    };
    /**
     * 福建
     */
    public static String[] fujianName = new String[]{
            "福州",
            "厦门",
            "莆田",
            "三明",
            "泉州",
            "漳州",
            "南平",
            "龙岩",
            "宁德"
    };
    /**
     * 福建
     */
    public static int[] fujianId = new int[]{
            109001274,
            109001289,
            109001297,
            109001304,
            109001318,
            109001332,
            109001345,
            109001357,
            109001366
    };
    /**
     * 福建-福州
     */
    public static String[] fujianFuzhouName = new String[]{
            "市辖区",
            "鼓楼",
            "台江",
            "仓山",
            "马尾",
            "晋安",
            "闽侯",
            "连江",
            "罗源",
            "闽清",
            "永泰",
            "平潭",
            "福清",
            "长乐"
    };
    /**
     * 福建-福州
     */
    public static int[] fujianFuzhouId = new int[]{
            109001275,
            109001276,
            109001277,
            109001278,
            109001279,
            109001280,
            109001281,
            109001282,
            109001283,
            109001284,
            109001285,
            109001286,
            109001287,
            109001288
    };
    /**
     * 福建-厦门
     */
    public static String[] fujianXiamenName = new String[]{
            "市辖区",
            "思明",
            "海沧",
            "湖里",
            "集美",
            "同安",
            "翔安"
    };
    /**
     * 福建-厦门
     */
    public static int[] fujianXiamenId = new int[]{
            109001290,
            109001291,
            109001292,
            109001293,
            109001294,
            109001295,
            109001296
    };
    /**
     * 福建-莆田
     */
    public static String[] fujianPutianName = new String[]{
            "市辖区",
            "城厢",
            "涵江",
            "荔城",
            "秀屿",
            "仙游"
    };
    /**
     * 福建-莆田
     */
    public static int[] fujianPutianId = new int[]{
            109001298,
            109001299,
            109001300,
            109001301,
            109001302,
            109001303
    };
    /**
     * 福建-三明
     */
    public static String[] fujianSanmingName = new String[]{
            "市辖区",
            "梅列",
            "三元",
            "明溪",
            "清流",
            "宁化",
            "大田",
            "尤溪",
            "沙县",
            "将乐",
            "泰宁",
            "建宁",
            "永安"
    };
    /**
     * 福建-三明
     */
    public static int[] fujianSanmingId = new int[]{
            109001305,
            109001306,
            109001307,
            109001308,
            109001309,
            109001310,
            109001311,
            109001312,
            109001313,
            109001314,
            109001315,
            109001316,
            109001317
    };
    /**
     * 福建-泉州
     */
    public static String[] fujianQuanzhouName = new String[]{
            "市辖区",
            "鲤城",
            "丰泽",
            "洛江",
            "泉港",
            "惠安",
            "安溪",
            "永春",
            "德化",
            "金门",
            "石狮",
            "晋江",
            "南安"
    };
    /**
     * 福建-泉州
     */
    public static int[] fujianQuanzhouId = new int[]{
            109001319,
            109001320,
            109001321,
            109001322,
            109001323,
            109001324,
            109001325,
            109001326,
            109001327,
            109001328,
            109001329,
            109001330,
            109001331
    };
    /**
     * 福建-漳州
     */
    public static String[] fujianZhangzhouName = new String[]{
            "市辖区",
            "芗城",
            "龙文",
            "云霄",
            "漳浦",
            "诏安",
            "长泰",
            "东山",
            "南靖",
            "平和",
            "华安",
            "龙海"
    };
    /**
     * 福建-漳州
     */
    public static int[] fujianZhangzhouId = new int[]{
            109001333,
            109001334,
            109001335,
            109001336,
            109001337,
            109001338,
            109001339,
            109001340,
            109001341,
            109001342,
            109001343,
            109001344
    };
    /**
     * 福建-南平
     */
    public static String[] fujianNanpingName = new String[]{
            "市辖区",
            "延平",
            "顺昌",
            "浦城",
            "光泽",
            "松溪",
            "政和",
            "邵武",
            "武夷山",
            "建瓯",
            "建阳"
    };
    /**
     * 福建-南平
     */
    public static int[] fujianNanpingId = new int[]{
            109001346,
            109001347,
            109001348,
            109001349,
            109001350,
            109001351,
            109001352,
            109001353,
            109001354,
            109001355,
            109001356
    };
    /**
     * 福建-龙岩
     */
    public static String[] fujianLongyanName = new String[]{
            "市辖区",
            "新罗",
            "长汀",
            "永定",
            "上杭",
            "武平",
            "连城",
            "漳平"
    };
    /**
     * 福建-龙岩
     */
    public static int[] fujianLongyanId = new int[]{
            109001358,
            109001359,
            109001360,
            109001361,
            109001362,
            109001363,
            109001364,
            109001365
    };
    /**
     * 福建-宁德
     */
    public static String[] fujianNingdeName = new String[]{
            "市辖区",
            "蕉城",
            "霞浦",
            "古田",
            "屏南",
            "寿宁",
            "周宁",
            "柘荣",
            "福安",
            "福鼎"
    };
    /**
     * 福建-宁德
     */
    public static int[] fujianNingdeId = new int[]{
            109001367,
            109001368,
            109001369,
            109001370,
            109001371,
            109001372,
            109001373,
            109001374,
            109001375,
            109001376
    };
    /**
     * 江西
     */
    public static String[] jiangxiName = new String[]{
            "南昌",
            "景德镇",
            "萍乡",
            "九江",
            "新余",
            "鹰潭",
            "赣州",
            "吉安",
            "宜春",
            "抚州",
            "上饶"
    };
    /**
     * 江西
     */
    public static int[] jiangxiId = new int[]{
            109001378,
            109001389,
            109001395,
            109001402,
            109001416,
            109001420,
            109001425,
            109001445,
            109001460,
            109001472,
            109001485
    };
    /**
     * 江西-南昌
     */
    public static String[] jiangxiNanchangName = new String[]{
            "市辖区",
            "东湖",
            "西湖",
            "青云谱",
            "湾里",
            "青山湖",
            "南昌",
            "新建",
            "安义",
            "进贤"
    };
    /**
     * 江西-南昌
     */
    public static int[] jiangxiNanchangId = new int[]{
            109001379,
            109001380,
            109001381,
            109001382,
            109001383,
            109001384,
            109001385,
            109001386,
            109001387,
            109001388
    };
    /**
     * 江西-景德镇
     */
    public static String[] jiangxiJingdezhenName = new String[]{
            "市辖区",
            "昌江",
            "珠山",
            "浮梁",
            "乐平"
    };
    /**
     * 江西-景德镇
     */
    public static int[] jiangxiJingdezhenId = new int[]{
            109001390,
            109001391,
            109001392,
            109001393,
            109001394
    };
    /**
     * 江西-萍乡
     */
    public static String[] jiangxiPinngxiangName = new String[]{
            "市辖区",
            "安源",
            "湘东",
            "莲花",
            "上栗",
            "芦溪"
    };
    /**
     * 江西-萍乡
     */
    public static int[] jiangxiPinngxiangId = new int[]{
            109001396,
            109001397,
            109001398,
            109001399,
            109001400,
            109001401
    };
    /**
     * 江西-九江
     */
    public static String[] jiangxiJiujiangName = new String[]{
            "市辖区",
            "庐山",
            "浔阳",
            "九江",
            "武宁",
            "修水",
            "永修",
            "德安",
            "星子",
            "都昌",
            "湖口",
            "彭泽",
            "瑞昌"
    };
    /**
     * 江西-九江
     */
    public static int[] jiangxiJiujiangId = new int[]{
            109001403,
            109001404,
            109001405,
            109001406,
            109001407,
            109001408,
            109001409,
            109001410,
            109001411,
            109001412,
            109001413,
            109001414,
            109001415
    };
    /**
     * 江西-新余
     */
    public static String[] jiangxiXinyuName = new String[]{
            "市辖区",
            "渝水",
            "分宜"
    };
    /**
     * 江西-新余
     */
    public static int[] jiangxiXinyuId = new int[]{
            109001417,
            109001418,
            109001419
    };
    /**
     * 江西-鹰潭
     */
    public static String[] jiangxiYingtanName = new String[]{
            "市辖区",
            "月湖",
            "余江",
            "贵溪"
    };
    /**
     * 江西-鹰潭
     */
    public static int[] jiangxiYingtanId = new int[]{
            109001421,
            109001422,
            109001423,
            109001424
    };
    /**
     * 江西-赣州
     */
    public static String[] jiangxiGanzhouName = new String[]{
            "市辖区",
            "章贡",
            "赣县",
            "信丰",
            "大余",
            "上犹",
            "崇义",
            "安远",
            "龙南",
            "定南",
            "全南",
            "宁都",
            "于都",
            "兴国",
            "会昌",
            "寻乌",
            "石城",
            "瑞金",
            "南康"
    };
    /**
     * 江西-赣州
     */
    public static int[] jiangxiGanzhouId = new int[]{
            109001426,
            109001427,
            109001428,
            109001429,
            109001430,
            109001431,
            109001432,
            109001433,
            109001434,
            109001435,
            109001436,
            109001437,
            109001438,
            109001439,
            109001440,
            109001441,
            109001442,
            109001443,
            109001444
    };
    /**
     * 江西-吉安
     */
    public static String[] jiangxiJianName = new String[]{
            "市辖区",
            "吉州",
            "青原",
            "吉安",
            "吉水",
            "峡江",
            "新干",
            "永丰",
            "泰和",
            "遂川",
            "万安",
            "安福",
            "永新",
            "井冈山"
    };
    /**
     * 江西-吉安
     */
    public static int[] jiangxiJianId = new int[]{
            109001446,
            109001447,
            109001448,
            109001449,
            109001450,
            109001451,
            109001452,
            109001453,
            109001454,
            109001455,
            109001456,
            109001457,
            109001458,
            109001459
    };
    /**
     * 江西-宜春
     */
    public static String[] jiangxiYichunName = new String[]{
            "市辖区",
            "袁州",
            "奉新",
            "万载",
            "上高",
            "宜丰",
            "靖安",
            "铜鼓",
            "丰城",
            "樟树",
            "高安"
    };
    /**
     * 江西-宜春
     */
    public static int[] jiangxiYichunId = new int[]{
            109001461,
            109001462,
            109001463,
            109001464,
            109001465,
            109001466,
            109001467,
            109001468,
            109001469,
            109001470,
            109001471
    };
    /**
     * 江西-抚州
     */
    public static String[] jiangxiFuzhouName = new String[]{
            "市辖区",
            "临川",
            "南城",
            "黎川",
            "南丰",
            "崇仁",
            "乐安",
            "宜黄",
            "金溪",
            "资溪",
            "东乡",
            "广昌"
    };
    /**
     * 江西-抚州
     */
    public static int[] jiangxiFuzhouId = new int[]{
            109001473,
            109001474,
            109001475,
            109001476,
            109001477,
            109001478,
            109001479,
            109001480,
            109001481,
            109001482,
            109001483,
            109001484
    };
    /**
     * 江西-上饶
     */
    public static String[] jiangxiShangraoName = new String[]{
            "市辖区",
            "信州",
            "上饶",
            "广丰",
            "玉山",
            "铅山",
            "横峰",
            "弋阳",
            "余干",
            "鄱阳",
            "万年",
            "婺源",
            "德兴"
    };
    /**
     * 江西-上饶
     */
    public static int[] jiangxiShangraoId = new int[]{
            109001486,
            109001487,
            109001488,
            109001489,
            109001490,
            109001491,
            109001492,
            109001493,
            109001494,
            109001495,
            109001496,
            109001497,
            109001498
    };
    /**
     * 甘肃
     */
    public static String[] gansuName = new String[]{
            "兰州",
            "嘉峪关",
            "金昌",
            "白银",
            "天水",
            "武威",
            "张掖",
            "平凉",
            "酒泉",
            "庆阳",
            "定西",
            "陇南",
            "临夏",
            "甘南"
    };
    /**
     * 甘肃
     */
    public static int[] gansuId = new int[]{
            109003207,
            109003217,
            109003219,
            109003223,
            109003230,
            109003239,
            109003245,
            109003253,
            109003262,
            109003271,
            109003281,
            109003290,
            109003301,
            109003310
    };
    /**
     * 甘肃-兰州
     */
    public static String[] gansuLanzhouName = new String[]{
            "市辖区",
            "城关",
            "七里河",
            "西固",
            "安宁",
            "红古",
            "永登",
            "皋兰",
            "榆中"
    };
    /**
     * 甘肃-兰州
     */
    public static int[] gansuLanzhouId = new int[]{
            109003208,
            109003209,
            109003210,
            109003211,
            109003212,
            109003213,
            109003214,
            109003215,
            109003216
    };
    /**
     * 甘肃-嘉峪关
     */
    public static String[] gansuJiayuguanName = new String[]{
            "市辖区"
    };
    /**
     * 甘肃-嘉峪关
     */
    public static int[] gansuJiayuguanId = new int[]{
            109003218
    };
    /**
     * 甘肃-金昌
     */
    public static String[] gansuJinchangName = new String[]{
            "市辖区",
            "金川",
            "永昌"
    };
    /**
     * 甘肃-金昌
     */
    public static int[] gansuJinchangId = new int[]{
            109003220,
            109003221,
            109003222
    };
    /**
     * 甘肃-白银
     */
    public static String[] gansuBaiyinName = new String[]{
            "市辖区",
            "白银",
            "平川",
            "靖远",
            "会宁",
            "景泰"
    };
    /**
     * 甘肃-白银
     */
    public static int[] gansuBaiyinId = new int[]{
            109003224,
            109003225,
            109003226,
            109003227,
            109003228,
            109003229
    };
    /**
     * 甘肃-天水
     */
    public static String[] gansuTianshuiName = new String[]{
            "市辖区",
            "秦城",
            "北道",
            "清水",
            "秦安",
            "甘谷",
            "武山",
            "张家川"
    };
    /**
     * 甘肃-天水
     */
    public static int[] gansuTianshuiId = new int[]{
            109003231,
            109003232,
            109003233,
            109003234,
            109003235,
            109003236,
            109003237,
            109003238
    };
    /**
     * 甘肃-威武
     */
    public static String[] gansuWeiwuName = new String[]{
            "市辖区",
            "凉州",
            "民勤",
            "古浪",
            "天祝"
    };
    /**
     * 甘肃-威武
     */
    public static int[] gansuWeiwuId = new int[]{
            109003240,
            109003241,
            109003242,
            109003243,
            109003244
    };
    /**
     * 甘肃-张掖
     */
    public static String[] gansuZhangyeName = new String[]{
            "市辖区",
            "甘州",
            "肃南",
            "民乐",
            "临泽",
            "高台",
            "山丹"
    };
    /**
     * 甘肃-张掖
     */
    public static int[] gansuZhangyeId = new int[]{
            109003246,
            109003247,
            109003248,
            109003249,
            109003250,
            109003251,
            109003252
    };
    /**
     * 甘肃-平凉
     */
    public static String[] gansuPingliangName = new String[]{
            "市辖区",
            "崆峒",
            "泾川",
            "灵台",
            "崇信",
            "华亭",
            "庄浪",
            "静宁"
    };
    /**
     * 甘肃-平凉
     */
    public static int[] gansuPingliangId = new int[]{
            109003254,
            109003255,
            109003256,
            109003257,
            109003258,
            109003259,
            109003260,
            109003261
    };
    /**
     * 甘肃-酒泉
     */
    public static String[] gansuJiuquanName = new String[]{
            "市辖区",
            "肃州",
            "金塔",
            "安西",
            "肃北",
            "阿克塞",
            "玉门",
            "敦煌"
    };
    /**
     * 甘肃-酒泉
     */
    public static int[] gansuJiuquanId = new int[]{
            109003263,
            109003264,
            109003265,
            109003266,
            109003267,
            109003268,
            109003269,
            109003270
    };
    /**
     * 甘肃-庆阳
     */
    public static String[] gansuQingyangName = new String[]{
            "市辖区",
            "西峰",
            "庆城",
            "环县",
            "华池",
            "合水",
            "正宁",
            "宁县",
            "镇原"
    };
    /**
     * 甘肃-庆阳
     */
    public static int[] gansuQingyangId = new int[]{
            109003272,
            109003273,
            109003274,
            109003275,
            109003276,
            109003277,
            109003278,
            109003279,
            109003280
    };
    /**
     * 甘肃-定西
     */
    public static String[] gansuDingxiName = new String[]{
            "市辖区",
            "安定",
            "通渭",
            "陇西",
            "渭源",
            "临洮",
            "漳县",
            "岷县"
    };
    /**
     * 甘肃-定西
     */
    public static int[] gansuDingxiId = new int[]{
            109003282,
            109003283,
            109003284,
            109003285,
            109003286,
            109003287,
            109003288,
            109003289
    };
    /**
     * 甘肃-陇南
     */
    public static String[] gansuLongnanName = new String[]{
            "市辖区",
            "武都",
            "成县",
            "文县",
            "宕昌",
            "康县",
            "西和",
            "礼县",
            "徽县",
            "两当"
    };
    /**
     * 甘肃-陇南
     */
    public static int[] gansuLongnanId = new int[]{
            109003291,
            109003292,
            109003293,
            109003294,
            109003295,
            109003296,
            109003297,
            109003298,
            109003299,
            109003300
    };
    /**
     * 甘肃 临夏
     */
    public static String[] gansuLinxiaName = new String[]{
            "临夏",
            "临夏",
            "康乐",
            "永靖",
            "广河",
            "和政",
            "东乡族",
            "积石山保安族东乡族撒"
    };
    /**
     * 甘肃 临夏
     */
    public static int[] gansuLinxiaId = new int[]{
            109003302,
            109003303,
            109003304,
            109003305,
            109003306,
            109003307,
            109003308,
            109003309
    };
    /**
     * 甘肃 甘南
     */
    public static String[] gansuGannanName = new String[]{
            "合作",
            "临潭",
            "卓尼",
            "舟曲",
            "迭部",
            "玛曲",
            "碌曲",
            "夏河"
    };
    /**
     * 甘肃 甘南
     */
    public static int[] gansuGannanId = new int[]{
            109003311,
            109003312,
            109003313,
            109003314,
            109003315,
            109003316,
            109003317,
            109003318
    };
    /**
     * 青海
     */
    public static String[] qinghaiName = new String[]{
            "西宁",
            "海东",
            "海北",
            "黄南",
            "海南",
            "果洛",
            "玉树",
            "海西"
    };
    /**
     * 青海
     */
    public static int[] qinghaiId = new int[]{
            109003320,
            109003329,
            109003336,
            109003341,
            109003346,
            109003352,
            109003359,
            109003366
    };
    /**
     * 青海-西宁
     */
    public static String[] qinghaiXiningName = new String[]{
            "市辖区",
            "城东",
            "城中",
            "城西",
            "城北",
            "大通",
            "湟中",
            "湟源"
    };
    /**
     * 青海-西宁
     */
    public static int[] qinghaiXiningId = new int[]{
            109003321,
            109003322,
            109003323,
            109003324,
            109003325,
            109003326,
            109003327,
            109003328
    };
    /**
     * 青海-海东
     */
    public static String[] qinghaiHaidongName = new String[]{
            "平安",
            "民和",
            "乐都",
            "互助",
            "化隆",
            "循化"
    };
    /**
     * 青海-海东
     */
    public static int[] qinghaiHaidongId = new int[]{
            109003330,
            109003331,
            109003332,
            109003333,
            109003334,
            109003335
    };
    /**
     * 青海-海北
     */
    public static String[] qinghaiHaibeiName = new String[]{
            "门源",
            "祁连",
            "海晏",
            "刚察"
    };
    /**
     * 青海-海北
     */
    public static int[] qinghaiHaibeiId = new int[]{
            109003337,
            109003338,
            109003339,
            109003340
    };
    /**
     * 青海-黄南
     */
    public static String[] qinghaiHuannanName = new String[]{
            "同仁",
            "尖扎",
            "泽库",
            "河南"
    };
    /**
     * 青海-黄南
     */
    public static int[] qinghaiHuannanId = new int[]{
            109003342,
            109003343,
            109003344,
            109003345
    };
    /**
     * 青海-海南
     */
    public static String[] qinghaiHainanName = new String[]{
            "共和",
            "同德",
            "贵德",
            "兴海",
            "贵南"
    };
    /**
     * 青海-海南
     */
    public static int[] qinghaiHainanId = new int[]{
            109003347,
            109003348,
            109003349,
            109003350,
            109003351
    };
    /**
     * 青海-果洛
     */
    public static String[] qinghaiGuoluoName = new String[]{
            "玛沁",
            "班玛",
            "甘德",
            "达日",
            "久治",
            "玛多"
    };
    /**
     * 青海-果洛
     */
    public static int[] qinghaiGuoluoId = new int[]{
            109003353,
            109003354,
            109003355,
            109003356,
            109003357,
            109003358
    };
    /**
     * 青海-玉树
     */
    public static String[] qinghaiYushuName = new String[]{
            "玉树",
            "杂多",
            "称多",
            "治多",
            "囊谦",
            "曲麻莱"
    };
    /**
     * 青海-玉树
     */
    public static int[] qinghaiYushuId = new int[]{
            109003360,
            109003361,
            109003362,
            109003363,
            109003364,
            109003365
    };
    /**
     * 青海-海西
     */
    public static String[] qinghaiHaixiName = new String[]{
            "格尔木",
            "德令哈",
            "乌兰",
            "都兰",
            "天峻"
    };
    /**
     * 青海-海西
     */
    public static int[] qinghaiHaixiId = new int[]{
            109003367,
            109003368,
            109003369,
            109003370,
            109003371
    };
    /**
     * 广东
     */
    public static String[] guangdongName = new String[]{
            "广州",
            "韶关",
            "深圳",
            "珠海",
            "汕头",
            "佛山",
            "江门",
            "湛江",
            "茂名",
            "肇庆",
            "惠州",
            "梅州",
            "汕尾",
            "河源",
            "阳江",
            "清远",
            "东莞",
            "中山",
            "潮州",
            "揭阳",
            "云浮"
    };
    /**
     * 广东
     */
    public static int[] guangdongId = new int[]{
            109002148,
            109002162,
            109002174,
            109002182,
            109002187,
            109002196,
            109002203,
            109002212,
            109002223,
            109002231,
            109002241,
            109002248,
            109002258,
            109002264,
            109002272,
            109002278,
            109002288,
            109002289,
            109002290,
            109002295,
            109002302
    };
    /**
     * 广东-云浮
     */
    public static String[] guangdongYunfuName = new String[]{
            "市辖区",
            "云城",
            "新兴",
            "郁南",
            "云安",
            "罗定"
    };
    /**
     * 广东-云浮
     */
    public static int[] guangdongYunfuId = new int[]{
            109002303,
            109002304,
            109002305,
            109002306,
            109002307,
            109002308
    };
    /**
     * 广东-广州
     */
    public static String[] guangdongGuangzhouName = new String[]{
            "市辖区",
            "东山",
            "荔湾",
            "越秀",
            "海珠",
            "天河",
            "芳村",
            "白云",
            "黄埔",
            "番禺",
            "花都",
            "增城",
            "从化"
    };
    /**
     * 广东-广州
     */
    public static int[] guangdongGuangzhouId = new int[]{
            109002149,
            109002150,
            109002151,
            109002152,
            109002153,
            109002154,
            109002155,
            109002156,
            109002157,
            109002158,
            109002159,
            109002160,
            109002161
    };
    /**
     * 广东-韶关
     */
    public static String[] guangdongShaoguanName = new String[]{
            "市辖区",
            "武江",
            "浈江",
            "曲江",
            "始兴",
            "仁化",
            "翁源",
            "乳源",
            "新丰",
            "乐昌",
            "南雄"
    };
    /**
     * 广东-韶关
     */
    public static int[] guangdongShaoguanId = new int[]{
            109002163,
            109002164,
            109002165,
            109002166,
            109002167,
            109002168,
            109002169,
            109002170,
            109002171,
            109002172,
            109002173
    };
    /**
     * 广东-深圳
     */
    public static String[] guangdongShenzhenName = new String[]{
            "市辖区",
            "罗湖",
            "福田",
            "南山",
            "宝安",
            "龙岗",
            "盐田"
    };
    /**
     * 广东-深圳
     */
    public static int[] guangdongShenzhenId = new int[]{
            109002175,
            109002176,
            109002177,
            109002178,
            109002179,
            109002180,
            109002181
    };
    /**
     * 广东-珠海
     */
    public static String[] guangdongZhuhaiName = new String[]{
            "市辖区",
            "香洲",
            "斗门",
            "金湾"
    };
    /**
     * 广东-珠海
     */
    public static int[] guangdongZhuhaiId = new int[]{
            109002183,
            109002184,
            109002185,
            109002186
    };
    /**
     * 广东-汕头
     */
    public static String[] guangdongShantouName = new String[]{
            "市辖区",
            "龙湖",
            "金平",
            "濠江",
            "潮阳",
            "潮南",
            "澄海",
            "南澳"
    };
    /**
     * 广东-汕头
     */
    public static int[] guangdongShantouId = new int[]{
            109002188,
            109002189,
            109002190,
            109002191,
            109002192,
            109002193,
            109002194,
            109002195
    };
    /**
     * 广东-佛山
     */
    public static String[] guangdongFoshanName = new String[]{
            "市辖区",
            "禅城",
            "南海",
            "顺德",
            "三水",
            "高明"
    };
    /**
     * 广东-佛山
     */
    public static int[] guangdongFoshanId = new int[]{
            109002197,
            109002198,
            109002199,
            109002200,
            109002201,
            109002202
    };
    /**
     * 广东-江门
     */
    public static String[] guangdongJiangmenName = new String[]{
            "市辖区",
            "蓬江",
            "江海",
            "新会",
            "台山",
            "开平",
            "鹤山",
            "恩平"
    };
    /**
     * 广东-江门
     */
    public static int[] guangdongJiangmenId = new int[]{
            109002204,
            109002205,
            109002206,
            109002207,
            109002208,
            109002209,
            109002210,
            109002211
    };
    /**
     * 广东-湛江
     */
    public static String[] guangdongZhanjiangName = new String[]{
            "市辖区",
            "赤坎",
            "霞山",
            "坡头",
            "麻章",
            "遂溪",
            "徐闻",
            "廉江",
            "雷州",
            "吴川"
    };
    /**
     * 广东-湛江
     */
    public static int[] guangdongZhanjiangId = new int[]{
            109002213,
            109002214,
            109002215,
            109002216,
            109002217,
            109002218,
            109002219,
            109002220,
            109002221,
            109002222
    };
    /**
     * 广东-茂名
     */
    public static String[] guangdongMaomingName = new String[]{
            "市辖区",
            "茂南",
            "茂港",
            "电白",
            "高州",
            "化州",
            "信宜"
    };
    /**
     * 广东-茂名
     */
    public static int[] guangdongMaomingId = new int[]{
            109002224,
            109002225,
            109002226,
            109002227,
            109002228,
            109002229,
            109002230
    };
    /**
     * 广东-肇庆
     */
    public static String[] guangdongZhaoqingName = new String[]{
            "市辖区",
            "端州",
            "鼎湖",
            "广宁",
            "怀集",
            "封开",
            "德庆",
            "高要",
            "四会"
    };
    /**
     * 广东-肇庆
     */
    public static int[] guangdongZhaoqingId = new int[]{
            109002232,
            109002233,
            109002234,
            109002235,
            109002236,
            109002237,
            109002238,
            109002239,
            109002240
    };
    /**
     * 广东-惠州
     */
    public static String[] guangdongHuizhouName = new String[]{
            "市辖区",
            "惠城",
            "惠阳",
            "博罗",
            "惠东",
            "龙门"
    };
    /**
     * 广东-惠州
     */
    public static int[] guangdongHuizhouId = new int[]{
            109002242,
            109002243,
            109002244,
            109002245,
            109002246,
            109002247
    };
    /**
     * 广东-梅州
     */
    public static String[] guangdongMeizhouName = new String[]{
            "市辖区",
            "梅江",
            "梅县",
            "大埔",
            "丰顺",
            "五华",
            "平远",
            "蕉岭",
            "兴宁"
    };
    /**
     * 广东-梅州
     */
    public static int[] guangdongMeizhouId = new int[]{
            109002249,
            109002250,
            109002251,
            109002252,
            109002253,
            109002254,
            109002255,
            109002256,
            109002257
    };
    /**
     * 广东-汕尾
     */
    public static String[] guangdongShanweiName = new String[]{
            "市辖区",
            "城区",
            "海丰",
            "陆河",
            "陆丰"
    };
    /**
     * 广东-汕尾
     */
    public static int[] guangdongShanweiId = new int[]{
            109002259,
            109002260,
            109002261,
            109002262,
            109002263
    };
    /**
     * 广东-河源
     */
    public static String[] guangdongHeyuanName = new String[]{
            "市辖区",
            "源城",
            "紫金",
            "龙川",
            "连平",
            "和平",
            "东源"
    };
    /**
     * 广东-河源
     */
    public static int[] guangdongHeyuanId = new int[]{
            109002265,
            109002266,
            109002267,
            109002268,
            109002269,
            109002270,
            109002271
    };
    /**
     * 广东-阳江
     */
    public static String[] guangdongYangjiangName = new String[]{
            "市辖区",
            "江城",
            "阳西",
            "阳东",
            "阳春"
    };
    /**
     * 广东-阳江
     */
    public static int[] guangdongYangjiangId = new int[]{
            109002273,
            109002274,
            109002275,
            109002276,
            109002277
    };
    /**
     * 广东-清远
     */
    public static String[] guangdongQingyuanName = new String[]{
            "市辖区",
            "清城",
            "佛冈",
            "阳山",
            "连山",
            "连南",
            "清新",
            "英德",
            "连州"
    };
    /**
     * 广东-清远
     */
    public static int[] guangdongQingyuanId = new int[]{
            109002279,
            109002280,
            109002281,
            109002282,
            109002283,
            109002284,
            109002285,
            109002286,
            109002287
    };
    /**
     * 广东-东莞
     */
    public static String[] guangdongDongguanName = new String[]{

    };
    /**
     * 广东-东莞
     */
    public static int[] guangdongDongguanId = new int[]{

    };
    /**
     * 广东- 中山
     */
    public static String[] guangdongZhongshanName = new String[]{

    };
    /**
     * 广东- 中山
     */
    public static int[] guangdongZhongshanId = new int[]{

    };
    /**
     * 广东- 潮州
     */
    public static String[] guangdongChaozhouName = new String[]{
            "市辖区",
            "湘桥",
            "潮安",
            "饶平"
    };
    /**
     * 广东- 潮州
     */
    public static int[] guangdongChaozhouId = new int[]{
            109002291,
            109002292,
            109002293,
            109002294
    };
    /**
     * 广东- 揭阳
     */
    public static String[] guangdongJieyangName = new String[]{
            "揭东",
            "揭西",
            "惠来",
            "普宁",
            "市辖区",
            "榕城"
    };
    /**
     * 广东- 揭阳
     */
    public static int[] guangdongJieyangId = new int[]{
            109002298,
            109002299,
            109002300,
            109002301,
            109002296,
            109002297
    };
    /**
     * 北京
     */
    public static String[] beijingName = new String[]{
            "市区","县区"
    };
    /**
     * 北京
     */
    public static int[] beijingId = new int[]{
            109000002,109000019
    };
    /**
     * 北京-市区
     */
    public static String[] beijingShiquName = new String[]{
            "东城",
            "西城",
            "崇文",
            "宣武",
            "朝阳",
            "丰台",
            "石景山",
            "海淀",
            "门头沟",
            "房山",
            "通州",
            "顺义",
            "昌平",
            "大兴",
            "怀柔",
            "平谷"
    };
    /**
     * 北京-市区
     */
    public static int[] beijingShiquId = new int[]{
            109000003,
            109000004,
            109000005,
            109000006,
            109000007,
            109000008,
            109000009,
            109000010,
            109000011,
            109000012,
            109000013,
            109000014,
            109000015,
            109000016,
            109000017,
            109000018
    };
    /**
     * 北京-县区
     */
    public static String[] beijingXianquName = new String[]{
            "密云",
            "延庆"
    };
    /**
     * 北京-县区
     */
    public static int[] beijingXianquId = new int[]{
            109000020,
            109000021
    };
    /**
     * 台湾
     */
    public static String[] taiwanName = new String[]{
    };
    /**
     * 台湾
     */
    public static int[] taiwanId = new int[]{
    };
    /**
     * 香港
     */
    public static String[] xianggangName = new String[]{
    };
    /**
     * 香港
     */
    public static int[] xianggangId = new int[]{
    };
    /**
     * 澳门
     */
    public static String[] aomenName = new String[]{
    };
    /**
     * 澳门
     */
    public static int[] aomenId = new int[]{
    };
    /**
     * 贵州
     */
    public static String[] guizhouName = new String[]{
            "贵阳",
            "六盘水",
            "遵义",
            "安顺",
            "铜仁",
            "黔西南",
            "毕节",
            "黔东南",
            "黔南"
    };
    /**
     * 贵州
     */
    public static int[] guizhouId = new int[]{
            109002742,
            109002754,
            109002759,
            109002775,
            109002783,
            109002794,
            109002803,
            109002812,
            109002829
    };
    /**
     * 贵州-贵阳
     */
    public static String[] guizhouGuiyangName = new String[]{
            "市辖区",
            "南明",
            "云岩",
            "花溪",
            "乌当",
            "白云",
            "小河",
            "开阳",
            "息烽",
            "修文",
            "清镇"
    };
    /**
     * 贵州-贵阳
     */
    public static int[] guizhouGuiyangId = new int[]{
            109002743,
            109002744,
            109002745,
            109002746,
            109002747,
            109002748,
            109002749,
            109002750,
            109002751,
            109002752,
            109002753
    };
    /**
     * 贵州-六盘水
     */
    public static String[] guizhouLiupanshuiName = new String[]{
            "钟山",
            "六枝特",
            "水城",
            "盘县"
    };
    /**
     * 贵州-六盘水
     */
    public static int[] guizhouLiupanshuiId = new int[]{
            109002755,
            109002756,
            109002757,
            109002758
    };
    /**
     * 贵州-遵义
     */
    public static String[] guizhouZuiyiName = new String[]{
            "市辖区",
            "红花岗",
            "汇川",
            "遵义",
            "桐梓",
            "绥阳",
            "正安",
            "道真",
            "务川",
            "凤冈",
            "湄潭",
            "余庆",
            "习水",
            "赤水",
            "仁怀"
    };
    /**
     * 贵州-遵义
     */
    public static int[] guizhouZuiyiId = new int[]{
            109002760,
            109002761,
            109002762,
            109002763,
            109002764,
            109002765,
            109002766,
            109002767,
            109002768,
            109002769,
            109002770,
            109002771,
            109002772,
            109002773,
            109002774
    };
    /**
     * 贵州-安顺
     */
    public static String[] guizhouAnshuiName = new String[]{
            "市辖区",
            "西秀",
            "平坝",
            "普定",
            "镇宁",
            "关岭",
            "紫云"
    };
    /**
     * 贵州-安顺
     */
    public static int[] guizhouAnshuiId = new int[]{
            109002776,
            109002777,
            109002778,
            109002779,
            109002780,
            109002781,
            109002782
    };
    /**
     * 贵州-铜仁
     */
    public static String[] guizhouTongrenName = new String[]{
            "铜仁",
            "江口",
            "玉屏",
            "石阡",
            "思南",
            "印江",
            "德江",
            "沿河",
            "松桃",
            "万山特"
    };
    /**
     * 贵州-铜仁
     */
    public static int[] guizhouTongrenId = new int[]{
            109002784,
            109002785,
            109002786,
            109002787,
            109002788,
            109002789,
            109002790,
            109002791,
            109002792,
            109002793
    };
    /**
     * 贵州-黔西南
     */
    public static String[] guizhouQianxinanName = new String[]{
            "兴义",
            "兴仁",
            "普安",
            "晴隆",
            "贞丰",
            "望谟",
            "册亨",
            "安龙"
    };
    /**
     * 贵州-黔西南
     */
    public static int[] guizhouQianxinanId = new int[]{
            109002795,
            109002796,
            109002797,
            109002798,
            109002799,
            109002800,
            109002801,
            109002802
    };
    /**
     * 贵州-毕节
     */
    public static String[] guizhouBijieName = new String[]{
            "毕节",
            "大方",
            "黔西",
            "金沙",
            "织金",
            "纳雍",
            "威宁彝族回族苗族自治",
            "赫章"
    };
    /**
     * 贵州-毕节
     */
    public static int[] guizhouBijieId = new int[]{
            109002804,
            109002805,
            109002806,
            109002807,
            109002808,
            109002809,
            109002810,
            109002811
    };
    /**
     * 贵州- 黔东南
     */
    public static String[] guizhouQiandongnanName = new String[]{
            "凯里",
            "黄平",
            "施秉",
            "三穗",
            "镇远",
            "岑巩",
            "天柱",
            "锦屏",
            "剑河",
            "台江",
            "黎平",
            "榕江",
            "从江",
            "雷山",
            "麻江",
            "丹寨"
    };
    /**
     * 贵州- 黔东南
     */
    public static int[] guizhouQiandongnanId = new int[]{
            109002813,
            109002814,
            109002815,
            109002816,
            109002817,
            109002818,
            109002819,
            109002820,
            109002821,
            109002822,
            109002823,
            109002824,
            109002825,
            109002826,
            109002827,
            109002828
    };
    /**
     * 贵州- 黔南
     */
    public static String[] guizhouQiannanName = new String[]{
            "都匀",
            "福泉",
            "荔波",
            "贵定",
            "瓮安",
            "独山",
            "平塘",
            "罗甸",
            "长顺",
            "龙里",
            "惠水",
            "三都"
    };
    /**
     * 贵州- 黔南
     */
    public static int[] guizhouQiannanId = new int[]{
            109002830,
            109002831,
            109002832,
            109002833,
            109002834,
            109002835,
            109002836,
            109002837,
            109002838,
            109002839,
            109002840,
            109002841
    };
    /**
     * 云南
     */
    public static String[] yunnanName = new String[]{
            "昆明",
            "曲靖",
            "玉溪",
            "保山",
            "昭通",
            "丽江",
            "思茅",
            "临沧",
            "楚雄",
            "红河",
            "文山",
            "西双版纳",
            "大理",
            "德宏",
            "怒江",
            "迪庆"
    };
    /**
     * 云南
     */
    public static int[] yunnanId = new int[]{
            109002843,
            109002859,
            109002870,
            109002881,
            109002888,
            109002901,
            109002908,
            109002920,
            109002930,
            109002941,
            109002955,
            109002964,
            109002968,
            109002981,
            109002987,
            109002992
    };
    /**
     * 云南-昆明
     */
    public static String[] yunnanKuimingName = new String[]{
            "市辖区",
            "五华",
            "盘龙",
            "官渡",
            "西山",
            "东川",
            "呈贡",
            "晋宁",
            "富民",
            "宜良",
            "石林",
            "嵩明",
            "禄劝",
            "寻甸",
            "安宁"
    };
    /**
     * 云南-昆明
     */
    public static int[] yunnanKuimingId = new int[]{
            109002844,
            109002845,
            109002846,
            109002847,
            109002848,
            109002849,
            109002850,
            109002851,
            109002852,
            109002853,
            109002854,
            109002855,
            109002856,
            109002857,
            109002858
    };
    /**
     * 云南-曲靖
     */
    public static String[] yunnanQujingName = new String[]{
            "市辖区",
            "麒麟",
            "马龙",
            "陆良",
            "师宗",
            "罗平",
            "富源",
            "会泽",
            "沾益",
            "宣威"
    };
    /**
     * 云南-曲靖
     */
    public static int[] yunnanQujingId = new int[]{
            109002860,
            109002861,
            109002862,
            109002863,
            109002864,
            109002865,
            109002866,
            109002867,
            109002868,
            109002869
    };
    /**
     * 云南-玉溪
     */
    public static String[] yunnanYuxiName = new String[]{
            "市辖区",
            "红塔",
            "江川",
            "澄江",
            "通海",
            "华宁",
            "易门",
            "峨山",
            "新平",
            "元江哈尼族彝族傣族自"
    };
    /**
     * 云南-玉溪
     */
    public static int[] yunnanYuxiId = new int[]{
            109002871,
            109002872,
            109002873,
            109002874,
            109002875,
            109002876,
            109002877,
            109002878,
            109002879,
            109002880
    };

    /**
     * 云南-保山
     */
    public static String[] yunnanBaoshanName = new String[]{
            "市辖区",
            "隆阳",
            "施甸",
            "腾冲",
            "龙陵",
            "昌宁"
    };
    /**
     * 云南-保山
     */
    public static int[] yunnanBaoshanId = new int[]{
            109002882,
            109002883,
            109002884,
            109002885,
            109002886,
            109002887
    };
    /**
     * 云南-昭通
     */
    public static String[] yunnanZhaotongName = new String[]{
            "市辖区",
            "昭阳",
            "鲁甸",
            "巧家",
            "盐津",
            "大关",
            "永善",
            "绥江",
            "镇雄",
            "彝良",
            "威信",
            "水富"
    };
    /**
     * 云南-昭通
     */
    public static int[] yunnanZhaotongId = new int[]{
            109002889,
            109002890,
            109002891,
            109002892,
            109002893,
            109002894,
            109002895,
            109002896,
            109002897,
            109002898,
            109002899,
            109002900
    };
    /**
     * 云南-丽江
     */
    public static String[] yunnanLijiangName = new String[]{
            "市辖区",
            "古城",
            "玉龙",
            "永胜",
            "华坪",
            "宁蒗"
    };
    /**
     * 云南-丽江
     */
    public static int[] yunnanLijiangId = new int[]{
            109002902,
            109002903,
            109002904,
            109002905,
            109002906,
            109002907
    };
    /**
     * 云南-思茅
     */
    public static String[] yunnanSimaoName = new String[]{
            "市辖区",
            "翠云",
            "普洱",
            "墨江",
            "景东",
            "景谷",
            "镇沅",
            "江城",
            "孟连傣族拉祜族佤族自",
            "澜沧",
            "西盟"
    };
    /**
     * 云南-思茅
     */
    public static int[] yunnanSimaoId = new int[]{
            109002909,
            109002910,
            109002911,
            109002912,
            109002913,
            109002914,
            109002915,
            109002916,
            109002917,
            109002918,
            109002919
    };
    /**
     * 云南-临沧
     */
    public static String[] yunnanLincangName = new String[]{
            "市辖区",
            "临翔",
            "凤庆",
            "云县",
            "永德",
            "镇康",
            "双江",
            "耿马",
            "沧源"
    };
    /**
     * 云南-临沧
     */
    public static int[] yunnanLincangId = new int[]{
            109002921,
            109002922,
            109002923,
            109002924,
            109002925,
            109002926,
            109002927,
            109002928,
            109002929
    };
    /**
     * 云南-楚雄
     */
    public static String[] yunnanChuxiongName = new String[]{
            "楚雄",
            "双柏",
            "牟定",
            "南华",
            "姚安",
            "大姚",
            "永仁",
            "元谋",
            "武定",
            "禄丰"
    };
    /**
     * 云南-楚雄
     */
    public static int[] yunnanChuxiongId = new int[]{
            109002931,
            109002932,
            109002933,
            109002934,
            109002935,
            109002936,
            109002937,
            109002938,
            109002939,
            109002940
    };
    /**
     * 云南-红河
     */
    public static String[] yunnanHongheName = new String[]{
            "个旧",
            "开远",
            "蒙自",
            "屏边",
            "建水",
            "石屏",
            "弥勒",
            "泸西",
            "元阳",
            "红河",
            "金平苗族瑶族傣族自治",
            "绿春",
            "河口"
    };
    /**
     * 云南-红河
     */
    public static int[] yunnanHongheId = new int[]{
            109002942,
            109002943,
            109002944,
            109002945,
            109002946,
            109002947,
            109002948,
            109002949,
            109002950,
            109002951,
            109002952,
            109002953,
            109002954
    };
    /**
     * 云南-文山
     */
    public static String[] yunnanWenshanName = new String[]{
            "文山",
            "砚山",
            "西畴",
            "麻栗坡",
            "马关",
            "丘北",
            "广南",
            "富宁"
    };
    /**
     * 云南-文山
     */
    public static int[] yunnanWenshanId = new int[]{
            109002956,
            109002957,
            109002958,
            109002959,
            109002960,
            109002961,
            109002962,
            109002963
    };
    /**
     * 云南-西双版纳
     */
    public static String[] yunnanXishuangbannaName = new String[]{
            "景洪",
            "勐海",
            "勐腊"
    };
    /**
     * 云南-西双版纳
     */
    public static int[] yunnanXishuangbannaId = new int[]{
            109002965,
            109002966,
            109002967
    };
    /**
     * 云南-大理
     */
    public static String[] yunnanDaliName = new String[]{
            "大理",
            "漾濞",
            "祥云",
            "宾川",
            "弥渡",
            "南涧",
            "巍山",
            "永平",
            "云龙",
            "洱源",
            "剑川",
            "鹤庆"
    };
    /**
     * 云南-大理
     */
    public static int[] yunnanDaliId = new int[]{
            109002969,
            109002970,
            109002971,
            109002972,
            109002973,
            109002974,
            109002975,
            109002976,
            109002977,
            109002978,
            109002979,
            109002980
    };
    /**
     * 云南- 德宏
     */
    public static String[] yunnanDehongName = new String[]{
            "瑞丽",
            "潞西",
            "梁河",
            "盈江",
            "陇川"
    };
    /**
     * 云南- 德宏
     */
    public static int[] yunnanDehongId = new int[]{
            109002982,
            109002983,
            109002984,
            109002985,
            109002986
    };
    /**
     * 云南-怒江
     */
    public static String[] yunnanNvjiangName = new String[]{
            "泸水",
            "福贡",
            "贡山",
            "兰坪"
    };
    /**
     * 云南-怒江
     */
    public static int[] yunnanNvjiangId = new int[]{
            109002988,
            109002989,
            109002990,
            109002991
    };
    /**
     * 云南-迪庆
     */
    public static String[] yunnanDiqingName = new String[]{
                    "香格里拉",
                    "德钦",
                    "维西"
            };
    /**
     * 云南-迪庆
     */
    public static int[] yunnanDiqingId = new int[]{
            109002993,
            109002994,
            109002995
    };
    /**
     * 西藏
     */
    public static String[] xizangName = new String[]{
            "拉萨",
            "昌都",
            "山南",
            "日喀则",
            "那曲",
            "阿里",
            "林芝"
    };
    /**
     * 西藏
     */
    public static int[] xizangId = new int[]{
            109002997,
            109003007,
            109003019,
            109003032,
            109003051,
            109003062,
            109003070
    };
    /**
     * 西藏-拉萨
     */
    public static String[] xizangLasaName = new String[]{
            "市辖区",
            "城关",
            "林周",
            "当雄",
            "尼木",
            "曲水",
            "堆龙德庆",
            "达孜",
            "墨竹工卡"
    };
    /**
     * 西藏-拉萨
     */
    public static int[] xizangLasaId = new int[]{
            109002998,
            109002999,
            109003000,
            109003001,
            109003002,
            109003003,
            109003004,
            109003005,
            109003006
    };
    /**
     * 西藏-昌都
     */
    public static String[] xizangChangduName = new String[]{
            "昌都",
            "江达",
            "贡觉",
            "类乌齐",
            "丁青",
            "察雅",
            "八宿",
            "左贡",
            "芒康",
            "洛隆",
            "边坝"
    };
    /**
     * 西藏-昌都
     */
    public static int[] xizangChangduId = new int[]{
            109003008,
            109003009,
            109003010,
            109003011,
            109003012,
            109003013,
            109003014,
            109003015,
            109003016,
            109003017,
            109003018
    };
    /**
     * 西藏-山南
     */
    public static String[] xizangShannanName = new String[]{
            "乃东",
            "扎囊",
            "贡嘎",
            "桑日",
            "琼结",
            "曲松",
            "措美",
            "洛扎",
            "加查",
            "隆子",
            "错那",
            "浪卡子"
    };
    /**
     * 西藏-山南
     */
    public static int[] xizangShannanId = new int[]{
            109003020,
            109003021,
            109003022,
            109003023,
            109003024,
            109003025,
            109003026,
            109003027,
            109003028,
            109003029,
            109003030,
            109003031
    };
    /**
     * 西藏-日喀则
     */
    public static String[] xizangRikazeName = new String[]{
            "日喀则",
            "南木林",
            "江孜",
            "定日",
            "萨迦",
            "拉孜",
            "昂仁",
            "谢通门",
            "白朗",
            "仁布",
            "康马",
            "定结",
            "仲巴",
            "亚东",
            "吉隆",
            "聂拉木",
            "萨嘎",
            "岗巴"
    };
    /**
     * 西藏-日喀则
     */
    public static int[] xizangRikazeId = new int[]{
            109003033,
            109003034,
            109003035,
            109003036,
            109003037,
            109003038,
            109003039,
            109003040,
            109003041,
            109003042,
            109003043,
            109003044,
            109003045,
            109003046,
            109003047,
            109003048,
            109003049,
            109003050
    };
    /**
     * 西藏-那曲
     */
    public static String[] xizangNaquName = new String[]{
            "那曲",
            "嘉黎",
            "比如",
            "聂荣",
            "安多",
            "申扎",
            "索县",
            "班戈",
            "巴青",
            "尼玛"
    };
    /**
     * 西藏-那曲
     */
    public static int[] xizangNaquId = new int[]{
            109003052,
            109003053,
            109003054,
            109003055,
            109003056,
            109003057,
            109003058,
            109003059,
            109003060,
            109003061
    };
    /**
     * 西藏-阿里
     */
    public static String[] xizangAliName = new String[]{
            "普兰",
            "札达",
            "噶尔",
            "日土",
            "革吉",
            "改则",
            "措勤"
    };
    /**
     * 西藏-阿里
     */
    public static int[] xizangAliId = new int[]{
            109003063,
            109003064,
            109003065,
            109003066,
            109003067,
            109003068,
            109003069
    };
    /**
     * 西藏-林芝
     */
    public static String[] xizangLinzhiName = new String[]{
            "林芝",
            "工布江达",
            "米林",
            "墨脱",
            "波密",
            "察隅",
            "朗县"
    };
    /**
     * 西藏-林芝
     */
    public static int[] xizangLinzhiId = new int[]{
            109003071,
            109003072,
            109003073,
            109003074,
            109003075,
            109003076,
            109003077
    };
    /**
     * 上海
     */
    public static String[] shanghaiName = new String[]{
            "市区",
            "县区"
    };
    /**
     * 上海
     */
    public static int[] shanghaiId = new int[]{
            109000866,
            109000885
    };
    /**
     * 上海-市区
     */
    public static String[] shanghaiShiquName = new String[]{
            "黄浦",
            "卢湾",
            "徐汇",
            "长宁",
            "静安",
            "普陀",
            "闸北",
            "虹口",
            "杨浦",
            "闵行",
            "宝山",
            "嘉定",
            "浦东新",
            "金山",
            "松江",
            "青浦",
            "南汇",
            "奉贤"
    };
    /**
     * 上海-市区
     */
    public static int[] shanghaiShiquId = new int[]{
            109000867,
            109000868,
            109000869,
            109000870,
            109000871,
            109000872,
            109000873,
            109000874,
            109000875,
            109000876,
            109000877,
            109000878,
            109000879,
            109000880,
            109000881,
            109000882,
            109000883,
            109000884
    };
    /**
     * 上海-县区
     */
    public static String[] shanghaiXianquName = new String[]{
            "崇明"
    };
    /**
     * 上海-县区
     */
    public static int[] shanghaiXianquId = new int[]{
            109000886
    };
    /**
     * 浙江
     */
    public static String[] zhejiangName = new String[]{
            "杭州",
            "宁波",
            "温州",
            "嘉兴",
            "湖州",
            "绍兴",
            "金华",
            "衢州",
            "舟山",
            "台州",
            "丽水"
    };
    /**
     * 浙江
     */
    public static int[] zhejiangId = new int[]{
            109001021,
            109001036,
            109001049,
            109001062,
            109001071,
            109001078,
            109001086,
            109001097,
            109001105,
            109001111,
            109001122
    };
    /**
     * 浙江-杭州
     */
    public static String[] zhejiangHangzhouName = new String[]{
            "市辖区",
            "上城",
            "下城",
            "江干",
            "拱墅",
            "西湖",
            "滨江",
            "萧山",
            "余杭",
            "桐庐",
            "淳安",
            "建德",
            "富阳",
            "临安"
    };
    /**
     * 浙江-杭州
     */
    public static int[] zhejiangHangzhouId = new int[]{
            109001022,
            109001023,
            109001024,
            109001025,
            109001026,
            109001027,
            109001028,
            109001029,
            109001030,
            109001031,
            109001032,
            109001033,
            109001034,
            109001035
    };
    /**
     * 浙江-宁波
     */
    public static String[] zhejiangNingboName = new String[]{
            "市辖区",
            "海曙",
            "江东",
            "江北",
            "北仑",
            "镇海",
            "鄞州",
            "象山",
            "宁海",
            "余姚",
            "慈溪",
            "奉化"
    };
    /**
     * 浙江-宁波
     */
    public static int[] zhejiangNingboId = new int[]{
            109001037,
            109001038,
            109001039,
            109001040,
            109001041,
            109001042,
            109001043,
            109001044,
            109001045,
            109001046,
            109001047,
            109001048
    };
    /**
     * 浙江-温州
     */
    public static String[] zhejiangWenzhouName = new String[]{
            "市辖区",
            "鹿城",
            "龙湾",
            "瓯海",
            "洞头",
            "永嘉",
            "平阳",
            "苍南",
            "文成",
            "泰顺",
            "瑞安",
            "乐清"
    };
    /**
     * 浙江-温州
     */
    public static int[] zhejiangWenzhouId = new int[]{
            109001050,
            109001051,
            109001052,
            109001053,
            109001054,
            109001055,
            109001056,
            109001057,
            109001058,
            109001059,
            109001060,
            109001061
    };
    /**
     * 浙江-嘉兴
     */
    public static String[] zhejiangJiaxingName = new String[]{
            "市辖区",
            "秀城",
            "秀洲",
            "嘉善",
            "海盐",
            "海宁",
            "平湖",
            "桐乡"
    };
    /**
     * 浙江-嘉兴
     */
    public static int[] zhejiangJiaxingId = new int[]{
            109001063,
            109001064,
            109001065,
            109001066,
            109001067,
            109001068,
            109001069,
            109001070
    };
    /**
     * 浙江-湖州
     */
    public static String[] zhejiangHuzhouName = new String[]{
            "市辖区",
            "吴兴",
            "南浔",
            "德清",
            "长兴",
            "安吉"
    };
    /**
     * 浙江-湖州
     */
    public static int[] zhejiangHuzhouId = new int[]{
            109001072,
            109001073,
            109001074,
            109001075,
            109001076,
            109001077
    };
    /**
     * 浙江- 绍兴
     */
    public static String[] zhejiangShaoxingName = new String[]{
                    "市辖区",
                    "越城",
                    "绍兴",
                    "新昌",
                    "诸暨",
                    "上虞",
                    "嵊州"
            };
    /**
     * 浙江- 绍兴
     */
    public static int[] zhejiangShaoxingId = new int[]{
            109001079,
            109001080,
            109001081,
            109001082,
            109001083,
            109001084,
            109001085
    };
    /**
     * 浙江-金华
     */
    public static String[] zhejiangJinhuaName = new String[]{
            "市辖区",
            "婺城",
            "金东",
            "武义",
            "浦江",
            "磐安",
            "兰溪",
            "义乌",
            "东阳",
            "永康"
    };
    /**
     * 浙江-金华
     */
    public static int[] zhejiangJinhuaId = new int[]{
            109001087,
            109001088,
            109001089,
            109001090,
            109001091,
            109001092,
            109001093,
            109001094,
            109001095,
            109001096
    };
    /**
     * 浙江-衢州
     */
    public static String[] zhejiangQuzhouName = new String[]{
            "市辖区",
            "柯城",
            "衢江",
            "常山",
            "开化",
            "龙游",
            "江山"
    };
    /**
     * 浙江-衢州
     */
    public static int[] zhejiangQuzhouId = new int[]{
            109001098,
            109001099,
            109001100,
            109001101,
            109001102,
            109001103,
            109001104
    };
    /**
     * 浙江-舟山
     */
    public static String[] zhejiangZhoushanName = new String[]{
                    "市辖区",
                    "定海",
                    "普陀",
                    "岱山",
                    "嵊泗"
            };
    /**
     * 浙江-舟山
     */
    public static int[] zhejiangZhoushanId = new int[]{
            109001106,
            109001107,
            109001108,
            109001109,
            109001110
    };
    /**
     * 浙江-台州
     */
    public static String[] zhejiangTaizhouName = new String[]{
            "市辖区",
            "椒江",
            "黄岩",
            "路桥",
            "玉环",
            "三门",
            "天台",
            "仙居",
            "温岭",
            "临海"
    };
    /**
     * 浙江-台州
     */
    public static int[] zhejiangTaizhouId = new int[]{
            109001112,
            109001113,
            109001114,
            109001115,
            109001116,
            109001117,
            109001118,
            109001119,
            109001120,
            109001121
    };
    /**
     * 浙江-丽水
     */
    public static String[] zhejiangLishuiName = new String[]{
            "市辖区",
            "莲都",
            "青田",
            "缙云",
            "遂昌",
            "松阳",
            "云和",
            "庆元",
            "景宁",
            "龙泉"
    };
    /**
     * 浙江-丽水
     */
    public static int[] zhejiangLishuiId = new int[]{
            109001123,
            109001124,
            109001125,
            109001126,
            109001127,
            109001128,
            109001129,
            109001130,
            109001131,
            109001132
    };
    /**
     * 辽宁
     */
    public static String[] liaoningName = new String[]{
            "沈阳",
            "大连",
            "鞍山",
            "抚顺",
            "本溪",
            "丹东",
            "锦州",
            "营口",
            "阜新",
            "辽阳",
            "盘锦",
            "铁岭",
            "朝阳",
            "葫芦岛"
    };
    /**
     * 辽宁
     */
    public static int[] liaoningId = new int[]{
            109000503,
            109000518,
            109000530,
            109000539,
            109000548,
            109000556,
            109000564,
            109000573,
            109000581,
            109000590,
            109000599,
            109000605,
            109000614,
            109000623
    };
    /**
     * 辽宁-沈阳
     */
    public static String[] liaoningShenyangName = new String[]{
            "市辖区",
            "和平",
            "沈河",
            "大东",
            "皇姑",
            "铁西",
            "苏家屯",
            "东陵",
            "新城子",
            "于洪",
            "辽中",
            "康平",
            "法库",
            "新民"
    };
    /**
     * 辽宁-沈阳
     */
    public static int[] liaoningShenyangId = new int[]{
            109000504,
            109000505,
            109000506,
            109000507,
            109000508,
            109000509,
            109000510,
            109000511,
            109000512,
            109000513,
            109000514,
            109000515,
            109000516,
            109000517
    };
    /**
     * 辽宁-大连
     */
    public static String[] liaoningDalianName = new String[]{
            "市辖区",
            "中山",
            "西岗",
            "沙河口",
            "甘井子",
            "旅顺口",
            "金州",
            "长海",
            "瓦房店",
            "普兰店",
            "庄河"
    };
    /**
     * 辽宁-大连
     */
    public static int[] liaoningDalianId = new int[]{
            109000519,
            109000520,
            109000521,
            109000522,
            109000523,
            109000524,
            109000525,
            109000526,
            109000527,
            109000528,
            109000529
    };
    /**
     * 辽宁-鞍山
     */
    public static String[] liaoningAnshanName = new String[]{
            "市辖区",
            "铁东",
            "铁西",
            "立山",
            "千山",
            "台安",
            "岫岩",
            "海城"
    };
    /**
     * 辽宁-鞍山
     */
    public static int[] liaoningAnshanId = new int[]{
            109000531,
            109000532,
            109000533,
            109000534,
            109000535,
            109000536,
            109000537,
            109000538
    };
    /**
     * 辽宁-抚顺
     */
    public static String[] liaoningFushuiName = new String[]{
            "市辖区",
            "新抚",
            "东洲",
            "望花",
            "顺城",
            "抚顺",
            "新宾",
            "清原"
    };
    /**
     * 辽宁-抚顺
     */
    public static int[] liaoningFushuiId = new int[]{
            109000540,
            109000541,
            109000542,
            109000543,
            109000544,
            109000545,
            109000546,
            109000547
    };
    /**
     * 辽宁-本溪
     */
    public static String[] liaoningBenxiName = new String[]{
            "市辖区",
            "平山",
            "溪湖",
            "明山",
            "南芬",
            "本溪",
            "桓仁"
    };
    /**
     * 辽宁-本溪
     */
    public static int[] liaoningBenxiId = new int[]{
            109000549,
            109000550,
            109000551,
            109000552,
            109000553,
            109000554,
            109000555
    };
    /**
     * 辽宁-丹东
     */
    public static String[] liaoningDandongName = new String[]{
            "市辖区",
            "元宝",
            "振兴",
            "振安",
            "宽甸",
            "东港",
            "凤城"
    };
    /**
     * 辽宁-丹东
     */
    public static int[] liaoningDandongId = new int[]{
            109000557,
            109000558,
            109000559,
            109000560,
            109000561,
            109000562,
            109000563
    };
    /**
     * 辽宁-锦州
     */
    public static String[] liaoningJinzhouName = new String[]{
            "市辖区",
            "古塔",
            "凌河",
            "太和",
            "黑山",
            "义县",
            "凌海",
            "北宁"
    };
    /**
     * 辽宁-锦州
     */
    public static int[] liaoningJinzhouId = new int[]{
            109000565,
            109000566,
            109000567,
            109000568,
            109000569,
            109000570,
            109000571,
            109000572
    };
    /**
     * 辽宁-营口
     */
    public static String[] liaoningYingkouName = new String[]{
            "市辖区",
            "站前",
            "西市",
            "鲅鱼圈",
            "老边",
            "盖州",
            "大石桥"
    };
    /**
     * 辽宁-营口
     */
    public static int[] liaoningYingkouId = new int[]{
            109000574,
            109000575,
            109000576,
            109000577,
            109000578,
            109000579,
            109000580
    };
    /**
     * 辽宁-阜新
     */
    public static String[] liaoningBuxinName = new String[]{
            "市辖区",
            "海州",
            "新邱",
            "太平",
            "清河门",
            "细河",
            "阜新",
            "彰武"
    };
    /**
     * 辽宁-阜新
     */
    public static int[] liaoningBuxinId = new int[]{
            109000582,
            109000583,
            109000584,
            109000585,
            109000586,
            109000587,
            109000588,
            109000589
    };
    /**
     * 辽宁-辽阳
     */
    public static String[] liaoningLiaoyangName = new String[]{
            "市辖区",
            "白塔",
            "文圣",
            "宏伟",
            "弓长岭",
            "太子河",
            "辽阳",
            "灯塔"
    };
    /**
     * 辽宁-辽阳
     */
    public static int[] liaoningLiaoyangId = new int[]{
            109000591,
            109000592,
            109000593,
            109000594,
            109000595,
            109000596,
            109000597,
            109000598
    };
    /**
     * 辽宁-盘锦
     */
    public static String[] liaoningPanjinName = new String[]{
            "市辖区",
            "双台子",
            "兴隆台",
            "大洼",
            "盘山"
    };
    /**
     * 辽宁-盘锦
     */
    public static int[] liaoningPanjinId = new int[]{
            109000600,
            109000601,
            109000602,
            109000603,
            109000604
    };
    /**
     * 辽宁-铁岭
     */
    public static String[] liaoningTielingName = new String[]{
            "市辖区",
            "银州",
            "清河",
            "铁岭",
            "西丰",
            "昌图",
            "调兵山",
            "开原"
    };
    /**
     * 辽宁-铁岭
     */
    public static int[] liaoningTielingId = new int[]{
            109000606,
            109000607,
            109000608,
            109000609,
            109000610,
            109000611,
            109000612,
            109000613
    };
    /**
     * 辽宁-朝阳
     */
    public static String[] liaoningChaoyangName = new String[]{
            "市辖区",
            "双塔",
            "龙城",
            "朝阳",
            "建平",
            "喀喇沁左翼蒙古族自治",
            "北票",
            "凌源"
    };
    /**
     * 辽宁-朝阳
     */
    public static int[] liaoningChaoyangId = new int[]{
            109000615,
            109000616,
            109000617,
            109000618,
            109000619,
            109000620,
            109000621,
            109000622
    };
    /**
     * 辽宁-葫芦岛
     */
    public static String[] liaoningHuludaoName = new String[]{
            "市辖区",
            "连山",
            "龙港",
            "南票",
            "绥中",
            "建昌",
            "兴城"
    };
    /**
     * 辽宁-葫芦岛
     */
    public static int[] liaoningHuludaoId = new int[]{
            109000624,
            109000625,
            109000626,
            109000627,
            109000628,
            109000629,
            109000630
    };
    /**
     * 吉林
     */
    public static String[] jilinName = new String[]{
            "长春",
            "吉林",
            "四平",
            "辽源",
            "通化",
            "白山",
            "松原",
            "白城",
            "延边"
    };
    /**
     * 吉林
     */
    public static int[] jilinId = new int[]{
            109000632,
            109000644,
            109000655,
            109000663,
            109000669,
            109000678,
            109000686,
            109000693,
            109000700
    };
    /**
     * 吉林-长春
     */
    public static String[] jilinChangchunName = new String[]{
            "市辖区",
            "南关",
            "宽城",
            "朝阳",
            "二道",
            "绿园",
            "双阳",
            "农安",
            "九台",
            "榆树",
            "德惠"
    };
    /**
     * 吉林-长春
     */
    public static int[] jilinChangchunId = new int[]{
            109000633,
            109000634,
            109000635,
            109000636,
            109000637,
            109000638,
            109000639,
            109000640,
            109000641,
            109000642,
            109000643
    };
    /**
     * 吉林-吉林
     */
    public static String[] jilinJilinName = new String[]{
            "市辖区",
            "昌邑",
            "龙潭",
            "船营",
            "丰满",
            "永吉",
            "蛟河",
            "桦甸",
            "舒兰",
            "磐石"
    };
    /**
     * 吉林-吉林
     */
    public static int[] jilinJilinId = new int[]{
            109000645,
            109000646,
            109000647,
            109000648,
            109000649,
            109000650,
            109000651,
            109000652,
            109000653,
            109000654
    };
    /**
     * 吉林-四平
     */
    public static String[] jilinSipingName = new String[]{
            "市辖区",
            "铁西",
            "铁东",
            "梨树",
            "伊通",
            "公主岭",
            "双辽"
    };
    /**
     * 吉林-四平
     */
    public static int[] jilinSipingId = new int[]{
            109000656,
            109000657,
            109000658,
            109000659,
            109000660,
            109000661,
            109000662
    };
    /**
     * 吉林-辽源
     */
    public static String[] jilinLiaoyuanName = new String[]{
            "市辖区",
            "铁西",
            "铁东",
            "梨树",
            "伊通",
            "公主岭",
            "双辽"
    };
    /**
     * 吉林-辽源
     */
    public static int[] jilinLiaoyuanId = new int[]{
            109000656,
            109000657,
            109000658,
            109000659,
            109000660,
            109000661,
            109000662
    };
    /**
     * 吉林-通化
     */
    public static String[] jilinTonghuaName = new String[]{
            "市辖区",
            "东昌",
            "二道江",
            "通化",
            "辉南",
            "柳河",
            "梅河口",
            "集安",
    };
    /**
     * 吉林-通化
     */
    public static int[] jilinTonghuaId = new int[]{
            109000670,
            109000671,
            109000672,
            109000673,
            109000674,
            109000675,
            109000676,
            109000677
    };
    /**
     * 吉林-白山
     */
    public static String[] jilinBaishanName = new String[]{
            "市辖区",
            "八道江",
            "抚松",
            "靖宇",
            "长白",
            "江源",
            "临江"
    };
    /**
     * 吉林-白山
     */
    public static int[] jilinBaishanId = new int[]{
            109000679,
            109000680,
            109000681,
            109000682,
            109000683,
            109000684,
            109000685
    };
    /**
     * 吉林- 松原
     */
    public static String[] jilinSongyuanName = new String[]{
            "市辖区",
            "宁江",
            "前郭尔罗斯蒙古族自治",
            "长岭",
            "乾安",
            "扶余"
    };
    /**
     * 吉林- 松原
     */
    public static int[] jilinSongyuanId = new int[]{
            109000687,
            109000688,
            109000689,
            109000690,
            109000691,
            109000692
    };
    /**
     * 吉林-白城
     */
    public static String[] jilinBaichengName = new String[]{
            "市辖区",
            "洮北",
            "镇赉",
            "通榆",
            "洮南",
            "大安"
    };
    /**
     * 吉林-白城
     */
    public static int[] jilinBaichengId = new int[]{
            109000694,
            109000695,
            109000696,
            109000697,
            109000698,
            109000699
    };
    /**
     * 吉林-延边
     */
    public static String[] jilinYanbianName = new String[]{
            "延吉",
            "图们",
            "敦化",
            "珲春",
            "龙井",
            "和龙",
            "汪清",
            "安图"
    };
    /**
     * 吉林-延边
     */
    public static int[] jilinYanbianId = new int[]{
            109000701,
            109000702,
            109000703,
            109000704,
            109000705,
            109000706,
            109000707,
            109000708
    };

    /**
     *黑龙江
     */
    public static String[] heilongjiangName = new String[]{

            "哈尔滨",
            "齐齐哈尔",
            "鸡西",
            "鹤岗",
            "双鸭山",
            "大庆",
            "伊春",
            "佳木斯",
            "七台河",
            "牡丹江",
            "黑河",
            "绥化",
            "大兴安岭"
    };

    /**
     * 黑龙江
     */
    public static int[] heilongjiangId = new int[]{
            109000710,
            109000731,
            109000749,
            109000760,
            109000770,
            109000780,
            109000791,
            109000810,
            109000823,
            109000829,
            109000841,
            109000849,
            109000861
    };
    /**
     *黑龙江-哈尔滨
     */
    public static String[] heilongjingHaerbinName = new String[]{

            "市辖区",
            "道里",
            "南岗",
            "道外",
            "香坊",
            "动力",
            "平房",
            "松北",
            "呼兰",
            "依兰",
            "方正",
            "宾县",
            "巴彦",
            "木兰",
            "通河",
            "延寿",
            "阿城",
            "双城",
            "尚志",
            "五常"
    };

    /**
     * 黑龙江-哈尔滨
     */
    public static int[] heilongjingHaerbinId = new int[]{
            109000711,
            109000712,
            109000713,
            109000714,
            109000715,
            109000716,
            109000717,
            109000718,
            109000719,
            109000720,
            109000721,
            109000722,
            109000723,
            109000724,
            109000725,
            109000726,
            109000727,
            109000728,
            109000729,
            109000730
    };
    /**
     *黑龙江-齐齐哈尔
     */
    public static String[] heilongjiangQiqihaerName = new String[]{

            "市辖区",
            "龙沙",
            "建华",
            "铁锋",
            "昂昂溪",
            "富拉尔基",
            "碾子山",
            "梅里斯",
            "龙江",
            "依安",
            "泰来",
            "甘南",
            "富裕",
            "克山",
            "克东",
            "拜泉",
            "讷河"
    };

    /**
     * 黑龙江-齐齐哈尔
     */
    public static int[] heilongjiangQiqihaerId = new int[]{
            109000732,
            109000733,
            109000734,
            109000735,
            109000736,
            109000737,
            109000738,
            109000739,
            109000740,
            109000741,
            109000742,
            109000743,
            109000744,
            109000745,
            109000746,
            109000747,
            109000748
    };

    /**
     *黑龙江-鸡西
     */
    public static String[] heilongjiangJixiName = new String[]{
            "市辖区",
            "鸡冠",
            "恒山",
            "滴道",
            "梨树",
            "城子河",
            "麻山",
            "鸡东",
            "虎林",
            "密山"
    };

    /**
     * 黑龙江-鸡西
     */
    public static int[] heilongjiangJixiId = new int[]{
            109000750,
            109000751,
            109000752,
            109000753,
            109000754,
            109000755,
            109000756,
            109000757,
            109000758,
            109000759
    };

    /**
     *黑龙江-鹤岗
     */
    public static String[] heilongjiangHegangName = new String[]{
            "市辖区",
            "向阳",
            "工农",
            "南山",
            "兴安",
            "东山",
            "兴山",
            "萝北",
            "绥滨"
    };

    /**
     * 黑龙江-鹤岗
     */
    public static int[] heilongjiangHegangId = new int[]{
            109000761,
            109000762,
            109000763,
            109000764,
            109000765,
            109000766,
            109000767,
            109000768,
            109000769
    };
    /**
     *黑龙江-双鸭山
     */
    public static String[] heilongjiangShuangyashanName = new String[]{
            "市辖区",
            "尖山",
            "岭东",
            "四方台",
            "宝山",
            "集贤",
            "友谊",
            "宝清",
            "饶河"
    };

    /**
     * 黑龙江-双鸭山
     */
    public static int[] heilongjiangShuangyashanId = new int[]{
            109000771,
            109000772,
            109000773,
            109000774,
            109000775,
            109000776,
            109000777,
            109000778,
            109000779
    };
    /**
     *黑龙江-大庆
     */
    public static String[] heilongjiangDaqingName = new String[]{
            "市辖区",
            "萨尔图",
            "龙凤",
            "让胡路",
            "红岗",
            "大同",
            "肇州",
            "肇源",
            "林甸",
            "杜尔伯特"
    };

    /**
     * 黑龙江-大庆
     */
    public static int[] heilongjiangDaqingId = new int[]{
            109000781,
            109000782,
            109000783,
            109000784,
            109000785,
            109000786,
            109000787,
            109000788,
            109000789,
            109000790
    };
    /**
     *黑龙江-伊春
     */
    public static String[] heilongjiangYichunName = new String[]{
            "市辖区",
            "伊春",
            "南岔",
            "友好",
            "西林",
            "翠峦",
            "新青",
            "美溪",
            "金山屯",
            "五营",
            "乌马河",
            "汤旺河",
            "带岭",
            "乌伊岭",
            "红星",
            "上甘岭",
            "嘉荫",
            "铁力"
    };

    /**
     * 黑龙江-伊春
     */
    public static int[] heilongjiangYichunId = new int[]{
            109000792,
            109000793,
            109000794,
            109000795,
            109000796,
            109000797,
            109000798,
            109000799,
            109000800,
            109000801,
            109000802,
            109000803,
            109000804,
            109000805,
            109000806,
            109000807,
            109000808,
            109000809
    };
    /**
     *黑龙江-佳木斯
     */
    public static String[] heilongjiangJiamusiName = new String[]{
            "市辖区",
            "永红",
            "向阳",
            "前进",
            "东风",
            "郊区",
            "桦南",
            "桦川",
            "汤原",
            "抚远",
            "同江",
            "富锦"
    };

    /**
     * 黑龙江-佳木斯
     */
    public static int[] heilongjiangJiamusiId = new int[]{
            109000811,
            109000812,
            109000813,
            109000814,
            109000815,
            109000816,
            109000817,
            109000818,
            109000819,
            109000820,
            109000821,
            109000822
    };

    /**
     *黑龙江-七台河
     */
    public static String[] heilongjiangQitaiheName = new String[]{
            "市辖区",
            "新兴",
            "桃山",
            "茄子河",
            "勃利"
    };

    /**
     * 黑龙江-七台河
     */
    public static int[] heilongjiangQitaiheId = new int[]{
            109000824,
            109000825,
            109000826,
            109000827,
            109000828
    };
    /**
     *黑龙江-牡丹江
     */
    public static String[] heilongjiangMudanjiangName = new String[]{
            "市辖区",
            "东安",
            "阳明",
            "爱民",
            "西安",
            "东宁",
            "林口",
            "绥芬河",
            "海林",
            "宁安",
            "穆棱"
    };

    /**
     * 黑龙江-牡丹江
     */
    public static int[] heilongjiangMudanjiangId = new int[]{
            109000830,
            109000831,
            109000832,
            109000833,
            109000834,
            109000835,
            109000836,
            109000837,
            109000838,
            109000839,
            109000840
    };
    /**
     *黑龙江-黑河
     */
    public static String[] heilongjiangHeiheName = new String[]{
            "市辖区",
            "爱辉",
            "嫩江",
            "逊克",
            "孙吴",
            "北安",
            "五大连池"
    };

    /**
     * 黑龙江-黑河
     */
    public static int[] heilongjiangHeiheId = new int[]{
            109000842,
            109000843,
            109000844,
            109000845,
            109000846,
            109000847,
            109000848
    };
    /**
     *黑龙江-绥化
     */
    public static String[] heilongjiangSuihuaName = new String[]{
            "市辖区",
            "北林",
            "望奎",
            "兰西",
            "青冈",
            "庆安",
            "明水",
            "绥棱",
            "安达",
            "肇东",
            "海伦"
    };

    /**
     * 黑龙江-绥化
     */
    public static int[] heilongjiangSuihuaId = new int[]{
            109000850,
            109000851,
            109000852,
            109000853,
            109000854,
            109000855,
            109000856,
            109000857,
            109000858,
            109000859,
            109000860
    };
    /**
     *黑龙江-大兴安岭
     */
    public static String[] heilongjiangDaxinganlingName = new String[]{
            "呼玛",
            "塔河",
            "漠河"
    };

    /**
     * 黑龙江-大兴安岭
     */
    public static int[] heilongjiangDaxinganlingId = new int[]{
            109000862,
            109000863,
            109000864
    };

    /**
     *广西
     */
    public static String[] guangxiName = new String[]{

            "南宁",
            "柳州",
            "桂林",
            "梧州",
            "北海",
            "防城港",
            "钦州",
            "贵港",
            "玉林",
            "百色",
            "贺州",
            "河池",
            "来宾",
            "崇左"
    };

    /**
     *广西
     */
    public static int[]  guangxiId = new int[]{
            109002310,
            109002324,
            109002336,
            109002355,
            109002364,
            109002370,
            109002376,
            109002382,
            109002389,
            109002397,
            109002411,
            109002417,
            109002430,
            109002438

    };

    /**
     *广西-南宁
     */
    public static String[] guangxiNanningName = new String[]{

            "市辖区",
            "兴宁",
            "青秀",
            "江南",
            "西乡塘",
            "良庆",
            "邕宁",
            "武鸣",
            "隆安",
            "马山",
            "上林",
            "宾阳",
            "横县"

    };

    /**
     *广西-南宁
     */
    public static int[] guangxiNanningId = new int[]{
            109002311,
            109002312,
            109002313,
            109002314,
            109002315,
            109002316,
            109002317,
            109002318,
            109002319,
            109002320,
            109002321,
            109002322,
            109002323
    };
    /**
     *广西-柳州
     */
    public static String[] guangxiLiuzhouName = new String[]{

            "市辖区",
            "城中",
            "鱼峰",
            "柳南",
            "柳北",
            "柳江",
            "柳城",
            "鹿寨",
            "融安",
            "融水",
            "三江"
    };
    /**
     * 广西-柳州
     */
    public static int[] guangxiLiuzhouId = new int[]{


            109002325,
            109002326,
            109002327,
            109002328,
            109002329,
            109002330,
            109002331,
            109002332,
            109002333,
            109002334,
            109002335

    };

    /**
     *广西-桂林
     */
    public static String[] guangxiGuilinName = new String[]{

            "市辖区",
            "秀峰",
            "叠彩",
            "象山",
            "七星",
            "雁山",
            "阳朔",
            "临桂",
            "灵川",
            "全州",
            "兴安",
            "永福",
            "灌阳",
            "龙胜",
            "资源",
            "平乐",
            "荔蒲",
            "恭城"

    };

    /**
     * 广西-桂林
     */
    public static int[] guangxiGuilinId = new int[]{
            109002337,
            109002338,
            109002339,
            109002340,
            109002341,
            109002342,
            109002343,
            109002344,
            109002345,
            109002346,
            109002347,
            109002348,
            109002349,
            109002350,
            109002351,
            109002352,
            109002353,
            109002354
    };


    /**
     *广西-梧州
     */
    public static String[] guangxiWuzhouName = new String[]{

            "市辖区",
            "万秀",
            "蝶山",
            "长洲",
            "苍梧",
            "藤县",
            "蒙山",
            "岑溪"
    };

    /**
     * 广西-梧州
     */
    public static int[] guangxiWuzhouId = new int[]{
            109002356,
            109002357,
            109002358,
            109002359,
            109002360,
            109002361,
            109002362,
            109002363
    };

    /**
     *广西-北海
     */
    public static String[] guangxiBeihaiName = new String[]{

            "市辖区",
            "海城",
            "银海",
            "铁山港",
            "合浦"
    };

    /**
     * 广西-北海
     */
    public static int[] guangxiBeihaiId = new int[]{
            109002365,
            109002366,
            109002367,
            109002368,
            109002369
    };
    /**
     *广西-防城港
     */
    public static String[] guangxiFangchenggangName = new String[]{

            "市辖区",
            "港口",
            "防城",
            "上思",
            "东兴"
    };

    /**
     * 广西-防城港
     */
    public static int[] guangxiFangchenggangId = new int[]{
            109002371,
            109002372,
            109002373,
            109002374,
            109002375
    };
    /**
     *广西-钦州
     */
    public static String[] guangxiQinzhouName = new String[]{

            "市辖区",
            "钦南",
            "钦北",
            "灵山",
            "浦北"
    };

    /**
     * 广西-钦州
     */
    public static int[] guangxiQinzhouId = new int[]{
            109002377,
            109002378,
            109002379,
            109002380,
            109002381
    };

    /**
     *广西-贵港
     */
    public static String[] guangxiGuigangName = new String[]{

            "市辖区",
            "港北",
            "港南",
            "覃塘",
            "平南",
            "桂平"
    };

    /**
     * 广西-贵港
     */
    public static int[] guangxiGuigangId = new int[]{
            109002383,
            109002384,
            109002385,
            109002386,
            109002387,
            109002388
    };
    /**
     *广西-玉林
     */
    public static String[] guangxiYulinName = new String[]{

            "市辖区",
            "玉州",
            "容县",
            "陆川",
            "博白",
            "兴业",
            "北流"
    };

    /**
     * 广西-玉林
     */
    public static int[] guangxiYulinId = new int[]{
            109002390,
            109002391,
            109002392,
            109002393,
            109002394,
            109002395,
            109002396
    };

    /**
     *广西-百色
     */
    public static String[] guangxiBaiseName = new String[]{

            "市辖区",
            "右江",
            "田阳",
            "田东",
            "平果",
            "德保",
            "靖西",
            "那坡",
            "凌云",
            "乐业",
            "田林",
            "西林",
            "隆林"
    };

    /**
     * 广西-百色
     */
    public static int[] guangxiBaiseId = new int[]{
            109002398,
            109002399,
            109002400,
            109002401,
            109002402,
            109002403,
            109002404,
            109002405,
            109002406,
            109002407,
            109002408,
            109002409,
            109002410
    };


    /**
     *广西-贺州
     */
    public static String[] guangxiHezhouName = new String[]{

            "市辖区",
            "八步",
            "昭平",
            "钟山",
            "富川"
    };

    /**
     * 广西-贺州
     */
    public static int[] guangxiHezhouId = new int[]{
            109002412,
            109002413,
            109002414,
            109002415,
            109002416
    };

    /**
     *广西-河池
     */
    public static String[] guangxiHechiName = new String[]{

            "市辖区",
            "金城江",
            "南丹",
            "天峨",
            "凤山",
            "东兰",
            "罗城",
            "环江",
            "巴马",
            "都安",
            "大化",
            "宜州"
    };

    /**
     * 广西-河池
     */
    public static int[] guangxiHechiId = new int[]{
            109002418,
            109002419,
            109002420,
            109002421,
            109002422,
            109002423,
            109002424,
            109002425,
            109002426,
            109002427,
            109002428,
            109002429
    };
    /**
     *广西-来宾
     */
    public static String[] guangxiLaibinName = new String[]{

            "市辖区",
            "兴宾",
            "忻城",
            "象州",
            "武宣",
            "金秀",
            "合山"
    };

    /**
     * 广西-来宾
     */
    public static int[] guangxiLaibinId = new int[]{
            109002431,
            109002432,
            109002433,
            109002434,
            109002435,
            109002436,
            109002437
    };
    /**
     *广西-崇左
     */
    public static String[] guangxiChongzuoName = new String[]{

            "市辖区",
            "江洲",
            "扶绥",
            "宁明",
            "龙州",
            "大新",
            "天等",
            "凭祥"
    };

    /**
     * 广西-崇左
     */
    public static int[] guangxiChongzuoId = new int[]{
            109002439,
            109002440,
            109002441,
            109002442,
            109002443,
            109002444,
            109002445,
            109002446
    };
    /**
     *海南
     */
    public static String[] hainanName = new String[]{

            "海口",
            "三亚",
            "省直辖县"
    };

    /**
     * 海南
     */
    public static int[] hainanId = new int[]{
            109002448,
            109002454,
            109002456
    };

    /**
     *海南-海口
     */
    public static String[] hainanHaikouName = new String[]{
            "市辖区",
            "秀英",
            "龙华",
            "琼山",
            "美兰"
    };

    /**
     * 海南-海口
     */
    public static int[] hainanHaikouId = new int[]{
            109002449,
            109002450,
            109002451,
            109002452,
            109002453
    };

    /**
     *海南-三亚
     */
    public static String[] hainanSanyaName = new String[]{
            "市辖区"

    };
    /**
     * 海南-三亚
     */
    public static int[] hainanSanyaId = new int[]{
            109002455

    };
    /**
     *海南-省直辖县
     */
    public static String[] hainanShengzhixiaxianName = new String[]{
            "五指山",
            "琼海",
            "儋州",
            "文昌",
            "万宁",
            "东方",
            "定安",
            "屯昌",
            "澄迈",
            "临高",
            "白沙",
            "昌江",
            "乐东",
            "陵水",
            "保亭",
            "琼中",
            "西沙群岛",
            "南沙群岛",
            "中沙群岛的岛礁及其海"

    };

    /**
     * 海南-省直辖县
     */
    public static int[] hainanShengzhixiaxianId = new int[]{

            109002457,
            109002458,
            109002459,
            109002460,
            109002461,
            109002462,
            109002463,
            109002464,
            109002465,
            109002466,
            109002467,
            109002468,
            109002469,
            109002470,
            109002471,
            109002472,
            109002473,
            109002474,
            109002475
    };
    /**
     * 重庆
     */
    public static String[] chongqingName = new String[]{

            "市区",
            "县区"
    };

    /**
     * 重庆
     */
    public static int[] chongqingId = new int[]{
            109002477,
            109002493
    };

    /**
     * 重庆-市区
     */
    public static String[] chongqingShiquName = new String[]{
            "万州",
            "涪陵",
            "涪陵",
            "大渡口",
            "江北",
            "沙坪坝",
            "九龙坡",
            "南岸",
            "北碚",
            "万盛",
            "双桥",
            "渝北",
            "巴南",
            "黔江",
            "长寿",
            "江津",
            "合川",
            "永川",
            "南川"


    };
    /**
     * 重庆-市区
     */
    public static int[] chongqingShiquId = new int[]{
            109002478,
            109002479,
            109002480,
            109002481,
            109002482,
            109002483,
            109002484,
            109002485,
            109002486,
            109002487,
            109002488,
            109002489,
            109002490,
            109002491,
            109002492,
            109002516,
            109002517,
            109002518,
            109002519
    };
    /**
     * 重庆-县区
     */
    public static String[] chongqingXianquName = new String[]{

            "綦江",
            "潼南",
            "铜梁",
            "大足",
            "荣昌",
            "璧山",
            "梁平",
            "城口",
            "丰都",
            "垫江",
            "武隆",
            "忠县",
            "开县",
            "云阳",
            "奉节",
            "巫山",
            "巫溪",
            "石柱",
            "秀山",
            "酉阳",
            "彭水"

    };
    /**
     * 重庆-县区
     */
    public static int[] chongqingXianquId = new int[]{
            109002494,
            109002495,
            109002496,
            109002497,
            109002498,
            109002499,
            109002500,
            109002501,
            109002502,
            109002503,
            109002504,
            109002505,
            109002506,
            109002507,
            109002508,
            109002509,
            109002510,
            109002511,
            109002512,
            109002513,
            109002514
    };

}
